[{
	"name": "acoustic",
	"color": "#00004C",
	"x": -1275,
	"y": -1275,
	"z": -515,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n\n\n<p><b>Acoustic music</b> is music that solely or primarily uses instruments that produce sound through acoustic means, as opposed to electric or electronic means; typically the phrase refers to that made by acoustic string instruments. While all music was once acoustic, the retronym \"acoustic music\" appeared after the advent of electric instruments, such as the electric guitar, electric violin, electric organ and  synthesizer. Acoustic string instrumentations had long been a subset of popular music, particularly in folk. It stood in contrast to various other types of music in various eras, including big band music in the pre-rock era, and electric music in the rock era.\n</p><p>Writing for <i>Splendid</i>, music reviewer Craig Conley suggests, \"When music is labeled acoustic, unplugged, or unwired, the assumption seems to be that other types of music are <i>cluttered</i> by technology and overproduction and therefore aren't as <i>pure</i>\".</p>",
	"links": ["rock", "pop", "metalcore", "punk", "singer-songwriter", "folk", "grunge"]
}, {
	"name": "afrobeat",
	"color": "#e6cc1a",
	"x": 1025,
	"y": 765,
	"z": -1015,
	"info": "<p class=\"mw-empty-elt\">\n\n</p>\n<p><b>Afrobeat</b> is a music genre which involves the  combination of elements of West African musical styles such as fuji music and highlife with American funk and jazz influences, with a focus on chanted vocals, complex intersecting rhythms, and percussion.</p><p>The term was coined by Nigerian multi-instrumentalist and bandleader Fela Kuti, who is responsible for pioneering and popularizing the style both within and outside Nigeria. It was partially borne out of an attempt to distinguish Fela Kuti's music from the soul music of American artists such as James Brown.</p>",
	"links": ["funk", "soul", "blues", "folk", "singer-songwriter", "pagode", "sertanejo", "disney", "latin", "pop"]
}, {
	"name": "alt-rock",
	"color": "#262641",
	"x": -895,
	"y": -895,
	"z": -625,
	"info": "<p class=\"mw-empty-elt\">\n\n</p>\n<p><b>Alternative rock</b> (also called <b>alternative music</b>, <b>alt-rock</b> or simply <b>alternative</b>) is a style of rock music that emerged from the independent music underground of the 1980s and became widely popular in the 1990s. In this instance, the word \"alternative\" refers to the genre's distinction from mainstream rock music. The term's original meaning was broader, referring to a generation of musicians unified by their collective debt to either the musical style or simply the independent, DIY ethos of punk rock, which in the late 1970s laid the groundwork for alternative music. At times, \"alternative\" has been used as a catch-all description for music from underground rock artists that receives mainstream recognition, or for any music, whether rock or not, that is seen to be descended from punk rock (including some examples of punk itself, as well as new wave, and post-punk).\n</p><p>Alternative rock broadly consists of music that differs greatly in terms of its sound, social context and regional roots. By the end of the 1980s, magazines and zines, college radio airplay, and word of mouth had increased the prominence and highlighted the diversity of alternative rock, helping to define a number of distinct styles (and music scenes) such as noise pop, indie rock, grunge, and shoegaze. Most of these subgenres had achieved minor mainstream notice and a few bands representing them, such as Hüsker Dü and R.E.M., had even signed to major labels. But most alternative bands' commercial success was limited in comparison to other genres of rock and pop music at the time, and most acts remained signed to independent labels and received relatively little attention from mainstream radio, television, or newspapers. With the breakthrough of Nirvana and the popularity of the grunge and Britpop movements in the 1990s, alternative rock entered the musical mainstream and many alternative bands became successful.\n</p>",
	"links": ["grunge", "rock", "punk", "emo", "electronic", "funk", "pop"]
}, {
	"name": "alternative",
	"color": "#8c8c00",
	"x": 125,
	"y": 125,
	"z": -1275,
	"info": "A collection of all genres that are considered alternative, like alt-rock",
	"links": ["rock", "pop", "emo", "grunge", "punk", "electronic", "singer-songwriter"]
}, {
	"name": "ambient",
	"color": "#2626ff",
	"x": -895,
	"y": -895,
	"z": 1275,
	"info": "<p><b>Ambient music</b> is a genre of music that emphasises tone and atmosphere over traditional musical structure or rhythm. A form of slow instrumental music, it uses repetitive, but gentle, soothing sound patterns that can be described as sonic wallpaper to complement or alter one’s space and to generate a sense of calmness. The genre is said to evoke an \"atmospheric\", \"visual\", or \"unobtrusive\" quality.</p><p>Ambient music focuses on creating a mood or atmosphere through synthesizers and timbral qualities, often lacking the presence of any net composition, beat, or structured melody. It uses textural layers of sound without prevalent musical tropes, rewarding both passive and active listening. Nature soundscapes are usually included, and the sounds of acoustic instruments such as the piano, strings and flute, among others, may be emulated through a synthesizer. According to Brian Eno, one of its pioneers, \"Ambient music must be able to accommodate many levels of listening attention without enforcing one in particular; it must be as ignorable as it is interesting.\"</p><p>The genre originated in the United Kingdom in the 1960s and 1970s, when new musical instruments were being introduced to a wider market, such as the synthesizer. Eno named and popularized ambient music in 1978 with his album <i>Ambient 1: Music for Airports</i>. It saw a revival towards the late 1980s with the prominence of house and techno music, growing a cult following by the 1990s. Ambient music may have elements of new-age music and drone music, as some works may use sustained or repeated notes.</p><p>Ambient music did not achieve large commercial success, being criticized as having a \"boring\" and \"over-intellectual\" sound. Nevertheless, it has attained a certain degree of acclaim throughout the years, especially in the internet age. Due to its relatively open style, ambient music often takes influences from many other genres, ranging from classical, avant-garde music, folk, jazz, and world music, among several others.</p>",
	"links": ["electronic", "electro", "techno", "dubstep", "industrial"]
}, {
	"name": "anime",
	"color": "#80ff00",
	"x": 5,
	"y": 1275,
	"z": -1275,
	"info": "Theme music composed for films, anime (anison (アニソン)), tokusatsu and Japanese television dramas are considered a separate music genre. While musicians and bands from all genres of Japanese popular music have recorded songs and scores for Japanese television and film, there are several prominent musical artists and groups who have spent most of their musical careers performing theme songs and composing soundtracks for visual media. Such artists include Masato Shimon (current holder of the world record for most successful single in Japan for \"Oyoge! Taiyaki-kun\"),[41] Ichirou Mizuki, all of the members of JAM Project, Akira Kushida, Isao Sasaki and Mitsuko Horie. Notable composers of Japanese theme music include Joe Hisaishi, Michiru Oshima, Yoko Kanno, Toshihiko Sahashi, Yuki Kajiura, Kōtarō Nakagawa and Yuki Hayashi.",
	"links": ["j-pop", "j-rock", "j-idol", "j-dance"]
}, {
	"name": "black-metal",
	"color": "#262626",
	"x": -895,
	"y": -895,
	"z": -895,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n<p><b>Black metal</b> is an extreme subgenre of heavy metal music. Common traits include fast tempos, a shrieking vocal style, heavily distorted guitars played with tremolo picking, raw (lo-fi) recording, unconventional song structures, and an emphasis on atmosphere. Artists often appear in corpse paint and adopt pseudonyms.\n</p><p>During the 1980s, several thrash metal and death metal bands formed a prototype for black metal. This so-called first wave included bands such as Venom, Bathory, Mercyful Fate, Hellhammer and Celtic Frost. A second wave arose in the early 1990s, spearheaded by Norwegian bands such as Mayhem, Darkthrone, Burzum, Immortal, Emperor, Satyricon and Gorgoroth. The early Norwegian black metal scene developed the style of their forebears into a distinct genre. Norwegian-inspired black metal scenes emerged throughout Europe and North America, although some other scenes developed their own styles independently. Some prominent Swedish bands spawned during this second wave, such as Marduk, Nifelheim and Dark Funeral.</p><p>Initially a synonym for \"Satanic metal\", black metal is intentionally separate from mainstream culture and this dissociation is often reciprocated, due to the actions and ideologies regularly associated with the genre. Many artists express extreme anti-Christian and misanthropic views, advocating various forms of Satanism or ethnic paganism. In the 1990s, members of the scene were responsible for a spate of church burnings and murders. There is also a small neo-Nazi movement within black metal, although it has been shunned by many prominent artists. Generally, black metal strives to remain underground, inaccessible to the mainstream and those who are not committed.</p>",
	"links": ["metal"]
}, {
	"name": "bluegrass",
	"color": "#ff8533",
	"x": 1275,
	"y": 55,
	"z": -765,
	"info": "<p><b>Bluegrass music</b> is a form of American roots music. It was named by Bill Monroe who named his band The Blue Grass Boys. The Bluegrass boys played a Mountain Music style that Bill learned in Asheville North Carolina from bands like Wade Mainer's and other popular acts on radio station WWNC. the 1939–1996 band of Kentucky mandolin player and songwriter Bill Monroe, who is considered \"the father of bluegrass\". It was further developed by musicians who played with him, including 5-string banjo player Earl Scruggs and guitarist Lester Flatt.  It was then evolved by other musicians who admired the high-energy instrumental and vocal music Monroe's group created, and who carried it on into new bands, some of which created subgenres of bluegrass.\n</p><p>Bluegrass is influenced by the music of Appalachia and other styles, including gospel and jazz. Appalachian music itself has mixed roots in Irish, Scottish and English traditional music, and was also later influenced by the music of African-Americans through incorporation of jazz and blues elements.\n</p><p>Settlers from Britain and Ireland arrived in Appalachia during the 18th century, and brought with them the musical traditions of their homelands. These traditions consisted primarily of English and Scottish ballads—which were essentially unaccompanied narrative—and dance music, such as Irish reels, which were accompanied by a fiddle.  Many older bluegrass songs come directly from the British Isles. Several Appalachian bluegrass ballads, such as \"Pretty Saro\", \"Cuckoo Bird\" and \"House Carpenter\", come from England and preserve the English ballad tradition both melodically and lyrically.  Others, such as \"The Two Sisters\", also come from England; however, the lyrics are about Ireland.  Some bluegrass fiddle songs popular in Appalachia, such as \"Leather Britches\", and \"Pretty Polly\", have Scottish roots.  The dance tune \"Cumberland Gap\" may be derived from the tune that accompanies the Scottish ballad \"Bonnie George Campbell\".</p><p>In bluegrass, as in some forms of jazz, one or more instruments each takes its turn playing the melody and improvising around it, while the others perform accompaniment; this is especially typified in tunes called breakdowns. This is in contrast to old-time music, in which all instruments play the melody together or one instrument carries the lead throughout while the others provide accompaniment. Breakdowns are often characterized by rapid tempos and unusual instrumental dexterity and sometimes by complex chord changes.</p><p>There are three major subgenres of bluegrass. Traditional bluegrass has musicians playing folk songs, tunes with traditional chord progressions, and using only acoustic instruments, with an example being Bill Monroe. Progressive bluegrass groups may use electric instruments and import songs from other genres, particularly rock &amp; roll. Examples include Cadillac Sky and Bearfoot. Another subgenre, bluegrass gospel, uses Christian lyrics, soulful three- or four-part harmony singing, and sometimes the playing of instrumentals. A newer development in the bluegrass world is Neo-traditional bluegrass; exemplified by bands such as The Grascals and Mountain Heart; bands from this subgenre typically have more than one lead singer. \n</p><p>Bluegrass music has attracted a diverse following worldwide. Bluegrass pioneer Bill Monroe characterized the genre as: \"Scottish bagpipes and ole-time fiddlin'. It's Methodist and Holiness and Baptist. It's blues and jazz, and it has a high lonesome sound.\"</p>",
	"links": ["folk", "country", "classical", "comedy"]
}, {
	"name": "blues",
	"color": "#595900",
	"x": -385,
	"y": -385,
	"z": -1275,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n<p><b>Blues</b> is a music genre and musical form which was originated in the Deep South of the United States around the 1870s by African Americans from roots in African musical traditions, African-American work songs, spirituals, and the folk music of white Americans of European heritage. Blues incorporated spirituals, work songs, field hollers, shouts, chants, and rhymed simple narrative ballads. The blues form, ubiquitous in jazz, rhythm and blues and rock and roll, is characterized by the call-and-response pattern, the blues scale and specific chord progressions, of which the twelve-bar blues is the most common. Blue notes (or \"worried notes\"), usually thirds or fifths flattened in pitch, are also an essential part of the sound. Blues shuffles or walking bass reinforce the trance-like rhythm and form a repetitive effect known as the groove. \n</p><p>Blues as a genre is also characterized by its lyrics, bass lines, and instrumentation. Early traditional blues verses consisted of a single line repeated four times. It was only in the first decades of the 20th century that the most common current structure became standard: the AAB pattern, consisting of a line sung over the four first bars, its repetition over the next four, and then a longer concluding line over the last bars. Early blues frequently took the form of a loose narrative, often relating the racial discrimination and other challenges experienced by African-Americans.\n</p><p>Many elements, such as the call-and-response format and the use of blue notes, can be traced back to the music of Africa. The origins of the blues are also closely related to the religious music of the Afro-American community, the spirituals. The first appearance of the blues is often dated to after the ending of slavery and, later, the development of juke joints. It is associated with the newly acquired freedom of the former slaves. Chroniclers began to report about blues music at the dawn of the 20th century. The first publication of blues sheet music was in 1908. Blues has since evolved from unaccompanied vocal music and oral traditions of slaves into a wide variety of styles and subgenres. Blues subgenres include country blues, such as Delta blues and Piedmont blues, as well as urban blues styles such as Chicago blues and West Coast blues. World War II marked the transition from acoustic to electric blues and the progressive opening of blues music to a wider audience, especially white listeners. In the 1960s and 1970s, a hybrid form called blues rock developed, which blended blues styles with rock music.\n</p>",
	"links": ["soul", "funk", "rock", "rockabilly", "folk", "metal", "pop", "singer-songwriter"]
}, {
	"name": "bossanova",
	"color": "#ffd100",
	"x": 1275,
	"y": 815,
	"z": -1275,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n\n<p><b>Bossa nova</b> is a style of Brazilian music, which was developed and popularized in the 1950s and 1960s and is today one of the best-known Brazilian music styles abroad. The phrase <i>bossa nova</i> means literally \"new trend\" or \"new wave\" (<small>Portuguese pronunciation: </small><span title=\"Representation in the International Phonetic Alphabet (IPA)\">[ˈbɔsɐ ˈnɔvɐ]</span><small class=\"nowrap\"> (<span><span><span></span>listen</span></span>)</small>). A lyrical fusion of samba and jazz, bossa nova acquired a large following in the 1960s, initially among young musicians and college students.</p>",
	"links": ["mpb", "samba", "forro", "pagode"]
}, {
	"name": "brazil",
	"color": "#ffcc00",
	"x": 1275,
	"y": 765,
	"z": -1275,
	"info": "Describes music made in brazil",
	"links": ["mpb", "forro", "pagode", "samba", "sertanejo", "pop"]
}, {
	"name": "breakbeat",
	"color": "#3700da",
	"x": -725,
	"y": -1275,
	"z": 905,
	"info": "<p><b>Breakbeat</b> is a broad style of electronic or dance-oriented music which utilizes breaks, often sampled from earlier recordings in funk, jazz and R&amp;B, for the main rhythm. Breakbeats have been used in styles such as hip hop, jungle, drum and bass, hardcore, UK garage (including 2-step, breakstep and dubstep), and even pop and rock.\n</p>",
	"links": ["electronic", "edm", "disco", "funk", "soul", "house", "jazz", "electro", "techno", "afrobeat", "folk", "rock", "industrial"]
}, {
	"name": "british",
	"color": "#3a3a8c",
	"x": -695,
	"y": -695,
	"z": 125,
	"info": "<p>Throughout its history, the United Kingdom has been a major producer and source of musical creation, drawing its artistic basis from the history of the United Kingdom, from church music, Western culture and the ancient and traditional folk music and instrumentation of England, Scotland, Northern Ireland and Wales.\n</p><p>It has been argued that the United Kingdom has produced no composer of international importance or influence since Henry Purcell d.1695.\n</p><p>In parts the 20th century, influences from the music of the United States became dominant in popular music. Following this was the explosion of the British Invasion, while subsequent notable movements in British music include the new wave of British heavy metal and Britpop. The United Kingdom has one of the world's largest music industries today, with many British musicians having influenced modern music.\n</p>",
	"links": ["electronic", "rock", "pop", "folk", "rockabilly", "edm", "ska", "soul", "punk", "disco"]
}, {
	"name": "cantopop",
	"color": "#663300",
	"x": -255,
	"y": -765,
	"z": -1275,
	"info": "<p class=\"mw-empty-elt\">\n\n</p>\n<p><b>Cantopop</b> (Chinese: <span lang=\"zh-Hant\">粵語流行音樂</span>, a contraction of \"Cantonese pop music\") or <b>HK-pop</b> (short for \"Hong Kong pop music\") is a genre of Cantonese music made primarily in Hong Kong, and also used to refer to the cultural context of its production and consumption. Originating in the 1970s, Cantopop reached its height of popularity in the 1980s and 1990s before its slow decline in the 2000s and slight revival in the 2010s. The term \"Cantopop\" itself was coined in 1978 after \"Cantorock\", a term first used in 1974.</p><p>Besides Western pop music, Cantopop is also influenced by other international genres, including jazz, rock and roll, R&amp;B, disco, electronic and others. Cantopop songs are almost invariably performed in Cantonese. Boasting a multinational fanbase in Southeast Asian nations such as Vietnam, Thailand, Singapore, Malaysia and Indonesia, as well as in South Korea, Japan, Taiwan and the provinces of Guangdong and Guangxi in southeastern mainland China, Hong Kong, and occasionally Macau, remain the most significant hubs of the genre. Examples of some of the most significant figures in the Cantopop industry include Paula Tsui, Samuel Hui, Roman Tam, Jenny Tseng, George Lam, Alan Tam, Leslie Cheung, Danny Chan, Anita Mui, Beyond, Jacky Cheung, Andy Lau, Sandy Lam, Faye Wong, Leon Lai, Aaron Kwok, Sammi Cheng, Kelly Chen, Eason Chan, Joey Yung, etc.\n</p>",
	"links": ["mandopop"]
}, {
	"name": "chicago-house",
	"color": "#3600db",
	"x": -735,
	"y": -1275,
	"z": 915,
	"info": "<p><b>Chicago house</b> refers to house music produced during the mid to late 1980s within Chicago. The term is generally used to refer to the first ever house music productions, which were by Chicago-based artists in the 1980s.\n</p>",
	"links": ["electro", "techno", "funk", "edm", "disco", "electronic", "house", "gospel"]
}, {
	"name": "children",
	"color": "#bfff40",
	"x": 635,
	"y": 1275,
	"z": -635,
	"info": "Describes music written for children",
	"links": ["disney", "pop", "edm", "singer-songwriter", "folk", "country", "house", "rock", "latin", "comedy"]
}, {
	"name": "chill",
	"color": "#8f8f4c",
	"x": 155,
	"y": 155,
	"z": -515,
	"info": "<p><b>Chill-out</b> (shortened as <b>chill</b>; also typeset as <b>chillout</b> or <b>chill out</b>) is a loosely defined form of popular music characterized by slow tempos and relaxed moods. The definition of \"chill-out music\" has evolved throughout the decades, and generally refers to anything that might be identified as a modern type of easy listening. Some of the genres associated with \"chill\" include downtempo, classical, dance, jazz, hip hop, world, pop, lounge, and ambient.\n</p><p>The term was originally conflated with \"ambient house\" and came from an area called \"The White Room\" at the Heaven nightclub in London in 1989. By playing ambient mixes from sources such as Brian Eno and Mike Oldfield, the room allowed dancers a place to \"chill out\" from the faster-paced music of the main dance floor. Ambient house became widely popular over the next decade before it declined due to market saturation. In the early 2000s, DJs in Ibiza's Café Del Mar began creating ambient house mixes that drew on jazz, classical, Hispanic, and New Age sources. The popularity of chill-out subsequently expanded to dedicated satellite radio channels, outdoor festivals, and thousands of compilation albums. \"Chill-out\" was also removed from its ambient origins and became its own distinct genre.\n</p><p>\"Chillwave\" was an ironic term coined in 2009 for music that could already be described with existing labels such as dream pop. Despite the facetious intent behind the term, chillwave was the subject of serious, analytical articles by mainstream newspapers, and became one of the first genres to acquire an identity online. As on-demand music streaming services grew in the 2010s, a form of downtempo tagged as \"lo-fi hip hop\" or \"chillhop\" became popular among YouTube users.\n</p>",
	"links": ["pop", "rock", "reggae", "edm", "singer-songwriter", "funk", "soul", "electronic", "folk"]
}, {
	"name": "classical",
	"color": "#FFA500",
	"x": 1275,
	"y": 375,
	"z": -1275,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n\n<p><b>Classical music</b> is art music produced or rooted in the traditions of Western culture, including both liturgical (religious) and secular music. While a more precise term is also used to refer to the period from 1750 to 1820 (the Classical period), this article is about the broad span of time from before the 6th century AD to the present day, which includes the Classical period and various other periods. The central norms of this tradition became codified between 1550 and 1900, which is known as the common-practice period. The major time divisions of Western art music are as follows:\n</p>\n<ul><li>the ancient music period, before 500 AD</li>\n<li>the early music period, which includes\n<ul><li>the Medieval (500–1400) including\n<ul><li>the ars antiqua (1170–1310)</li>\n<li>the ars nova (1310–1377)</li>\n<li>the ars subtilior (1360–1420)</li></ul></li>\n<li>the Renaissance (1400–1600) eras.</li>\n<li>Baroque (1600–1750)</li>\n<li>the galant music period (1720s–1770s)</li></ul></li>\n<li>the common-practice period, which includes\n<ul><li>Baroque (1600–1750)</li>\n<li>the galant music period (1720s–1770s)</li>\n<li>Classical (1750–1820)</li>\n<li>Romantic eras (c.1780–1910)</li></ul></li>\n<li>the 20th and 21st centuries (1901–present) which includes:\n<ul><li>the modern (1890–1930) that overlaps from the late-19th century,</li>\n<li>impressionism (1875 or 1890–1925) that also overlaps from the late-19th century</li>\n<li>neoclassicism (1920–1950), predominantly in the inter-war period</li>\n<li>the high modern (1930–present)</li>\n<li>the postmodern (1930–present) eras</li>\n<li>the experimental (1950–present)</li>\n<li>contemporary (1945 or 1975–present)</li></ul></li></ul><p>European art music is largely distinguished from many other non-European classical and some popular musical forms by its system of staff notation, in use since about the 11th century. Catholic monks developed the first forms of modern European musical notation in order to standardize liturgy throughout the worldwide Church. Western staff notation is used by composers to indicate to the performer the pitches (which form the melodies, basslines and chords), tempo, metre and rhythms for a piece of music. This can leave less room for practices such as improvisation and <i>ad libitum</i> ornamentation, which are frequently heard in non-European art music and in popular-music styles such as jazz and blues. Another difference is that whereas most popular styles adopt the song (strophic) form or a derivation of this form, classical music has been noted for its development of highly sophisticated forms of instrumental music such as the symphony, concerto, fugue, sonata, and mixed vocal and instrumental styles such as opera, cantata, and mass.</p><p>The term \"classical music\" did not appear until the early 19th century, in an attempt to distinctly canonize the period from Johann Sebastian Bach to Ludwig van Beethoven as a golden age. The earliest reference to \"classical music\" recorded by the <i>Oxford English Dictionary</i> is from about 1829.</p>\n\n\n",
	"links": ["opera", "ambient", "electronic", "sleep"]
}, {
	"name": "club",
	"color": "#5959a6",
	"x": -385,
	"y": -385,
	"z": 385,
	"info": "<p><b>Electronic dance music</b> (<b>EDM</b>), also known as <b>dance music</b>, <b>club music</b>, or simply <b>dance</b>, is a broad range of percussive electronic music genres made largely for nightclubs, raves and festivals. It is generally produced for playback by disc jockeys who create seamless selections of tracks, called a mix by segueing from one recording to another. EDM producers also perform their music live in a concert or festival setting in what is sometimes called a live PA. In Europe, EDM is more commonly called 'dance music', or simply 'dance'.</p><p>In the late 1980s and early 1990s, following the emergence of raving, pirate radios and an upsurge of interest in club culture, EDM achieved widespread mainstream popularity in Europe. In the United States at that time, acceptance of dance culture was not universal; although both electro and Chicago house music were influential both in Europe and the United States, mainstream media outlets and the record industry remained openly hostile to it.There was also a perceived association between EDM and drug culture, which led governments at state and city level to enact laws and policies intended to halt the spread of rave culture.</p><p>Subsequently, in the new millennium, the popularity of EDM increased globally, largely in Australia and the United States. By the early 2010s, the term \"electronic dance music\" and the initialism \"EDM\" was being pushed by the American music industry and music press in an effort to rebrand American rave culture. Despite the industry's attempt to create a specific EDM brand, the initialism remains in use as an umbrella term for multiple genres, including house, techno, trance, drum and bass, and dubstep, as well as their respective subgenres.</p>",
	"links": ["edm", "pop", "house", "trance", "dancehall", "electro", "electronic", "dubstep", "breakbeat", "latin", "ambient", "disco"]
}, {
	"name": "comedy",
	"color": "#736c38",
	"x": -125,
	"y": -195,
	"z": -715,
	"info": "<p><b>Comedy music</b> is music that is comic or humorous in nature, encompassing a wide variety of music genres. Popular types of comedy music include parody music, novelty songs, comedy rock and comedy hip hop. Some comedians, such as Bo Burnham and Tim Hawkins, use songs in stand-up in addition to more traditional joke-telling methods, while others, such as \"Weird Al\" Yankovic and Lil Dicky, focus entirely on comedy music as their sole medium of humor.\n</p>",
	"links": ["country"]
}, {
	"name": "country",
	"color": "#000066",
	"x": -1275,
	"y": -1275,
	"z": -255,
	"info": "<p><b>Country music</b>, also known as  <b>country and western</b> (or simply <b>country</b>), and <b>hillbilly music</b>, is a genre of popular music that originated in the southern United States in the  early 1920s. It takes its roots from genres such as folk music (especially Appalachian folk and Western music) and blues.\n</p><p>Country music often consists of ballads and dance tunes with generally simple forms, folk lyrics, and harmonies accompanied by mostly string instruments such as banjos, electric and acoustic guitars, steel guitars (such as pedal steels and dobros), and fiddles as well as harmonicas. Blues modes have been used extensively throughout its recorded history.</p><p>According to Lindsey Starnes, the term <i>country music</i> gained popularity in the 1940s in preference to the earlier term <i>hillbilly music</i>; it came to encompass Western music, which evolved parallel to hillbilly music from similar roots, in the mid-20th century. In 2009 in the United States, country music was the most listened to rush hour radio genre during the evening commute, and second most popular in the morning commute.</p><p>The term <i>country music</i> is used today to describe many styles and subgenres. The origins of country music are the folk music of working class Americans, who blended popular songs, Irish and Celtic fiddle tunes, traditional English ballads, cowboy songs, and various musical traditions from European immigrants.\n</p>",
	"links": ["rock", "folk", "pop"]
}, {
	"name": "dance",
	"color": "#3333ff",
	"x": -765,
	"y": -765,
	"z": 1275,
	"info": "<p><b>Dance music</b> is music composed specifically to facilitate or accompany dancing. It can be either a whole musical piece or part of a larger musical arrangement. In terms of performance, the major categories are live dance music and recorded dance music. While there exist attestations of the combination of dance and music in ancient times (for example Ancient Greek vases sometimes show dancers accompanied by musicians), the earliest Western dance music that we can still reproduce with a degree of certainty are the surviving medieval dances. In the Baroque period, the major dance styles were noble court dances (see Baroque dance). In the classical music era, the minuet was frequently used as a third movement, although in this context it would not accompany any dancing. The waltz also arose later in the classical era. Both remained part of the romantic music period, which also saw the rise of various other nationalistic dance forms like the barcarolle, mazurka, ecossaise, ballade and polonaise.\n</p><p>Modern popular dance music initially emerged from late 19th century's Western ballroom and social dance music. During the early 20th century, ballroom dancing gained popularity among the working class who attended public dance halls. Dance music became enormously popular during the 1920s. In the 1930s, called the Swing era, Swing music was the popular dance music in America. In the 1950s, rock and roll became the popular dance music. The late 1960s saw the rise of soul and R&amp;B music. The rise of disco in the early 1970s led to dance music becoming popular with the public. By the late 1970s, electronic dance music was developing. This music, made using electronics, is a style of popular music commonly played in nightclubs, radio stations, shows and raves. Many subgenres of electronic dance music have evolved.\n</p>",
	"links": ["edm", "house", "pop", "electronic", "electro", "dancehall", "dubstep", "techno", "reggae", "disco", "trance"]
}, {
	"name": "dancehall",
	"color": "#a6a659",
	"x": 385,
	"y": 385,
	"z": -385,
	"info": "<p><b>Dancehall</b> is a genre of Jamaican popular music that originated in the late 1970s. Initially, dancehall was a more sparse version of reggae than the roots style, which had dominated much of the 1970s. In the mid-1980s, digital instrumentation became more prevalent, changing the sound considerably, with digital dancehall (or \"ragga\") becoming increasingly characterized by faster rhythms. Key elements of dancehall music include its extensive use of Jamaican Patois rather than Jamaican standard English and a focus on the track instrumentals (or \"riddims\").\n</p><p>\nDancehall saw initial mainstream success in Jamaica in the 1980s, and by the 1990s, it became increasingly popular in Jamaican diaspora communities. In the 2000s, dancehall experienced worldwide mainstream success, and by the 2010s, it began to heavily influence the work of established Western artists and producers, which has helped to further bring the genre into the Western music mainstream.</p>",
	"links": ["pop", "edm", "latin", "reggaeton", "reggae", "dub"]
}, {
	"name": "death-metal",
	"color": "#262626",
	"x": -895,
	"y": -895,
	"z": -895,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n<p><b>Death metal</b> is an extreme subgenre of heavy metal music. It typically employs heavily distorted and low-tuned guitars, played with techniques such as palm muting and tremolo picking, deep growling vocals, aggressive, powerful drumming featuring double kick and blast beat techniques, minor keys or atonality, abrupt tempo, key, and time signature changes, and chromatic chord progressions. The lyrical themes of death metal may invoke slasher film-stylized violence, religion (sometimes Satanism), occultism, Lovecraftian horror, nature, mysticism, mythology, philosophy, science fiction, and politics, and they may describe extreme acts, including mutilation, dissection, torture, rape, cannibalism, and necrophilia.\n</p><p>Building from the musical structure of thrash metal and early black metal, death metal emerged during the mid-1980s. Bands such as Venom, Celtic Frost, Slayer, and Kreator were important influences on the genre's creation. Possessed, Death, Necrophagia, Obituary, Autopsy, and Morbid Angel are often considered pioneers of the genre. In the late 1980s and early 1990s, death metal gained more media attention as popular genre. Niche record labels like Combat, Earache, and Roadrunner began to sign death metal bands at a rapid rate.</p><p>Since then, death metal has diversified, spawning several subgenres. Melodic death metal combines death metal elements with those of the new wave of British heavy metal. Technical death metal is a complex style, with uncommon time signatures, atypical rhythms, and unusual harmonies and melodies. Death-doom combines the deep growled vocals and double-kick drumming of death metal with the slow tempos and melancholic atmosphere of doom metal. Deathgrind, goregrind, and pornogrind mix the complexity of death metal with the intensity, speed, and brevity of grindcore. Deathcore combines death metal with metalcore traits. Death 'n' roll combines death metal's growled vocals and highly distorted, detuned guitar riffs with elements of 1970s hard rock and heavy metal.</p>",
	"links": ["metal", "grindcore", "metalcore", "rock"]
}, {
	"name": "deep-house",
	"color": "#1919ff",
	"x": -1025,
	"y": -1025,
	"z": 1275,
	"info": "<p><b>Deep house</b> is a subgenre of house music. It originated in the 1980s, initially fusing elements of Chicago house with 1980s jazz-funk and touches of soul music. Deep house tracks generally have a tempo of between 100 and 125 beats per minute (BPM). Its origins are attributed to Larry Heard's track 'Mystery of Love' in 1984.</p><p>This style of house music can often have an acoustic feeling. The online music store Beatport is credited with driving the popularity of deep house, but also mislabeling a number of artists in the process and giving rise to the future house genre.\n</p>",
	"links": ["house", "edm", "pop", "techno", "rock"]
}, {
	"name": "detroit-techno",
	"color": "#1c1c73",
	"x": -995,
	"y": -995,
	"z": -125,
	"info": "<p><b>Detroit techno</b> is a type of techno music that generally includes the first techno productions by Detroit-based artists during the 1980s and early 1990s. Prominent Detroit techno artists include Juan Atkins, Eddie Fowlkes, Derrick May, Jeff Mills, Kevin Saunderson, Blake Baxter and Mike Banks.\n</p>",
	"links": ["techno", "electro", "electronic", "house", "cantopop", "mandopop", "trance"]
}, {
	"name": "disco",
	"color": " #5c00c2",
	"x": null,
	"y": null,
	"z": null,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n<p><b>Disco</b> is a music genre and subculture that emerged in the late-1960s and early 1970s from the United States' urban nightlife scene. Disco started as a mixture of music from venues popular with African Americans, Hispanic and Latino Americans, Italian Americans, LGBT people (especially African-American and white gay men), and psychedelic hippies in Philadelphia and New York City during the late 1960s and early 1970s. Disco can be seen as a reaction to both the dominance of rock music and the stigmatization of dance music by the counterculture during this period. Several dance styles were also developed during this time, including the Bump and the Hustle.\n</p><p>The disco sound is typified by \"four-on-the-floor\" beats, syncopated basslines, and string sections, horns, electric piano, synthesizers, and electric rhythm guitars. Lead guitar features less frequently in disco than in rock. Well-known disco artists include Donna Summer, the Bee Gees, Gloria Gaynor, KC and the Sunshine Band, the Village People, Thelma Houston, and Chic,. While performers and singers garnered public attention, record producers working behind the scenes played an important role in developing the genre. Films such as <i>Saturday Night Fever</i> (1977) and <i>Thank God It's Friday</i> (1978) contributed to disco's mainstream popularity.\n</p><p>By the late 1970s, most major U.S. cities had thriving disco club scenes, and DJs would mix dance records at clubs such as Studio 54 in New York City, a venue popular among celebrities. Discothèque-goers often wore expensive, extravagant and sexy fashions. There was also a thriving drug subculture in the disco scene, particularly for drugs that would enhance the experience of dancing to the loud music and the flashing lights, such as cocaine and Quaaludes, the latter being so common in disco subculture that they were nicknamed \"disco biscuits\". Disco clubs were also associated with promiscuity as a reflection of the sexual revolution of this era in popular history. \n</p><p>Disco was the last popular music movement driven by the baby boom generation. It began to decline in the United States during 1979-80, and by 1982 it had lost nearly all popularity there. Disco Demolition Night, an anti-disco protest held in Chicago on July 12, 1979, remains the most well-known of several \"backlash\" incidents across the country that symbolized disco's declining fortune.\n</p><p>Disco was a key influence in the development of electronic dance music and house music. It has had several revivals, such as Madonna's highly successful 2005 album <i>Confessions on a Dance Floor</i>, and again in the 2010s, entering the pop charts in the US and the UK.\n</p>",
	"links": ["edm", "pop", "soul", "electro", "electronic", "latin", "funk", "rock", "dancehall", "k-pop", "house"]
}, {
	"name": "disney",
	"color": "#59ff00",
	"x": -385,
	"y": 1275,
	"z": -1275,
	"info": "Music created by Disney or for Disney films",
	"links": ["funk", "pop", "latin", "blues", "soul", "rock", "singer-songwriter", "mpb", "samba"]
}, {
	"name": "drum-and-bass",
	"color": "#0308f5",
	"x": -1245,
	"y": -1195,
	"z": 1175,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n<p><b>Drum and bass</b> (also written as \"<b>drum 'n' bass</b>\" or \"<b>drum &amp; bass</b>\"; commonly abbreviated as \"<b>D&amp;B</b>\", \"<b>DnB</b>\" or \"<b>D'n'B</b>\"), is a genre and branch of electronic music which emerged from rave and jungle scenes in Britain during the early 1990s. The style is often characterised by fast breakbeats (typically 160–180 beats per minute) with heavy bass and sub-bass lines, sampled sources, and synthesizers.\n</p><p>The popularity of drum and bass at its commercial peak ran parallel to several other homegrown dance styles in the UK including big beat and hard house. Drum and bass incorporates a number of scenes and styles. A major influence on jungle and drum and bass was the original Jamaican dub and reggae sound. Another feature of the style is the complex syncopation of the drum tracks' breakbeat.</p><p>Drum and bass subgenres include breakcore, ragga jungle, hardstep, darkstep, techstep, neurofunk, ambient drum and bass, liquid funk, jump up, deep, drumfunk, funkstep, sambass, dnbnoise, and drill 'n' bass. From its roots in the UK, the style has established itself around the world. Drum and bass has influenced many other genres like hip hop, big beat, dubstep, house, trip hop, ambient music, techno, jazz, rock and pop. Drum and bass is dominated by a relatively small group of record labels. The major international music labels had shown very little interest in the drum and bass scene, until BMG Rights Management acquired RAM in February 2016. Drum and bass remains most popular in the UK although it has developed scenes all around the world, in countries such as the United States, Germany, the Netherlands, Belgium, New Zealand, Greece, Canada, Austria, the Czech Republic, Slovakia and Australia.\n</p>",
	"links": ["edm", "breakbeat", "electronic", "house", "pop", "dubstep", "trance", "electro"]
}, {
	"name": "dub",
	"color": "#050feb",
	"x": -1225,
	"y": -1125,
	"z": 1075,
	"info": "<p><b>Dub</b> is a genre of music that grew out of reggae in the 1960s, and is commonly considered a subgenre, though it has developed to extend beyond the scope of reggae. Music in this genre consists predominantly of instrumental remixes of existing recordings and is achieved by significantly manipulating and reshaping the recordings, usually by removing the vocals from an existing music piece, and emphasizing the drum and bass parts (this stripped-down track is sometimes referred to as a riddim). Other techniques include dynamically adding extensive echo, reverb, panoramic delay, and occasional dubbing of vocal or instrumental snippets from the original version or other works. It was an early form of popular electronic music. The Roland Space Echo was widely used by dub producers in the 1970s to produce echo and delay effects.</p><p>Dub was pioneered by Osbourne \"King Tubby\" Ruddock, Lee \"Scratch\" Perry, Errol Thompson and others  in the late 1960s. Augustus Pablo is credited with bringing the melodica to dub, and is also among the pioneers and creators of the genre. Similar experiments with recordings at the mixing desk outside the dancehall environment were also done by producers Clive Chin and Herman Chin Loy. These producers, especially Ruddock and Perry, looked upon the mixing console as an instrument, manipulating tracks to come up with something new and different. \nDub has influenced many genres of music, including rock (most significantly the subgenre of post-punk and other kinds of punk), pop, hip hop, disco, and later house, techno, ambient, electronic dance music, and trip hop. Dub has become a basis for the genres of jungle and drum and bass Traditional dub has survived, and some of the originators, such as Lee \"Scratch\" Perry and Mad Professor, continue to produce new material.\n</p>",
	"links": ["edm", "pop", "breakbeat", "house", "dubstep", "electro", "electronic", "trance", "reggae", "rock", "hardstyle", "dancehall"]
}, {
	"name": "dubstep",
	"color": "#0d0dff",
	"x": -1145,
	"y": -1145,
	"z": 1275,
	"info": "<p class=\"mw-empty-elt\">\n\n\n</p>\n<p><b>Dubstep</b> is a genre of electronic dance music that originated in South London in the late 1990s. It is generally characterized by sparse, syncopated rhythmic patterns with bass lines that contain prominent sub-bass frequencies. The style emerged as an offshoot of UK garage, drawing on a lineage of related styles such as 2-step and dub reggae, as well as jungle,  broken beat, and grime. In the United Kingdom the origins of the genre can be traced back to the growth of the Jamaican sound system party scene in the early 1980s.</p><p>The earliest dubstep releases date back to 1998, and were usually featured as B-sides of 2-step garage single releases. These tracks were darker, more experimental remixes with less emphasis on vocals, and attempted to incorporate elements of breakbeat and drum and bass into 2-step. In 2001, this and other strains of dark garage music began to be showcased and promoted at London's night club Plastic People, at the \"Forward\" night (sometimes stylised as FWD&gt;&gt;), which went on to be considerably influential to the development of dubstep. The term \"dubstep\" in reference to a genre of music began to be used by around 2002 by labels such as Big Apple, Ammunition, and Tempa, by which time stylistic trends used in creating these remixes started to become more noticeable and distinct from 2-step and grime.</p><p>A very early supporter of the sound was BBC Radio 1 DJ John Peel, who started playing it from 2003 onwards. In 2004, the last year of his show, his listeners voted Distance, Digital Mystikz, and Plastician in their top 50 for the year. Dubstep started to enter mainstream British popular culture when it spread beyond small local scenes in late 2005 and early 2006; many websites devoted to the genre appeared on the Internet and aided the growth of the scene, such as dubstepforum, the download site Barefiles and blogs such as gutterbreakz. Simultaneously, the genre was receiving extensive coverage in music magazines such as <i>The Wire</i> and online publications such as Pitchfork, with a regular feature entitled <i>The Month In: Grime/Dubstep</i>. Interest in dubstep grew significantly after BBC Radio 1 DJ Mary Anne Hobbs started championing the genre, beginning with a show devoted to it (entitled \"Dubstep Warz\") in January 2006.</p><p>Towards the end of the 2000s and into the early 2010s, the genre started to become more commercially successful in the UK, with more singles and remixes entering the music charts. Music journalists and critics also noticed a dubstep influence in several pop artists' work. Around this time, producers also began to fuse elements of the original dubstep sound with other influences, creating fusion genres including future garage, the slower and more experimental post-dubstep, and the harsher electro house and heavy metal influenced brostep, the latter of which greatly contributed to dubstep's popularity in the United States.</p>",
	"links": ["house", "breakbeat", "edm", "pop", "electro", "trance", "reggae"]
}, {
	"name": "edm",
	"color": "#4c4cff",
	"x": -515,
	"y": -515,
	"z": 1275,
	"info": "<p><b>Electronic dance music</b> (<b>EDM</b>), also known as <b>dance music</b>, <b>club music</b>, or simply <b>dance</b>, is a broad range of percussive electronic music genres made largely for nightclubs, raves and festivals. It is generally produced for playback by disc jockeys who create seamless selections of tracks, called a mix by segueing from one recording to another. EDM producers also perform their music live in a concert or festival setting in what is sometimes called a live PA. In Europe, EDM is more commonly called 'dance music', or simply 'dance'.</p><p>In the late 1980s and early 1990s, following the emergence of raving, pirate radios and an upsurge of interest in club culture, EDM achieved widespread mainstream popularity in Europe. In the United States at that time, acceptance of dance culture was not universal; although both electro and Chicago house music were influential both in Europe and the United States, mainstream media outlets and the record industry remained openly hostile to it.There was also a perceived association between EDM and drug culture, which led governments at state and city level to enact laws and policies intended to halt the spread of rave culture.</p><p>Subsequently, in the new millennium, the popularity of EDM increased globally, largely in Australia and the United States. By the early 2010s, the term \"electronic dance music\" and the initialism \"EDM\" was being pushed by the American music industry and music press in an effort to rebrand American rave culture. Despite the industry's attempt to create a specific EDM brand, the initialism remains in use as an umbrella term for multiple genres, including house, techno, trance, drum and bass, and dubstep, as well as their respective subgenres.</p>",
	"links": ["metalcore", "pop", "house", "trance", "electro", "electronic", "hardstyle", "dubstep", "breakbeat"]
}, {
	"name": "electro",
	"color": "#5959ff",
	"x": -385,
	"y": -385,
	"z": 1275,
	"info": "<p><b>Electro</b> (or <b>electro-funk</b>) is a genre of electronic music and early hip hop directly influenced by the use of the Roland TR-808 drum machines, and funk. Records in the genre typically feature drum machines and heavy electronic sounds, usually without vocals, although if vocals are present they are delivered in a deadpan manner, often through electronic distortion such as vocoding and talkboxing. This is the main distinction between electro and previously prominent genres such as disco, in which the electronic sound was only part of the instrumentation. It also palpably deviates from its predecessor boogie for being less vocal-oriented and more focused on electronic beats produced by drum machines.\n</p><p>Following the decline of disco music in the United States, electro emerged as a fusion of funk and New York boogie. Early hip hop and rap combined with German and Japanese electropop influences such as Kraftwerk and Yellow Magic Orchestra (YMO) inspired the birth of electro. In 1982, producer Arthur Baker with Afrika Bambaataa released the seminal \"Planet Rock\", which was built using samples from Kraftwerk's Trans Europe Express and drum beats supplied by the TR-808. Planet Rock was followed later that year by another breakthrough electro record, Nunk by Warp 9. In 1983, Hashim created an electro funk sound which influenced Herbie Hancock, resulting in his hit single \"Rockit\". The early 1980s were electro's mainstream peak. By the mid 1980s, the genre moved away from its electronic and funk influences, using harder edged beats and rock samples, exemplified by Run DMC. Electro became popular again in the late 1990s with artists such as Anthony Rother and DJs such as Dave Clarke. A third wave of popularity occurred in 2007. Electro has branched out into subgenres, including Electrocore and Skweee, which developed in Sweden and Finland.\n</p>",
	"links": ["edm", "house", "pop", "trance", "electronic", "hardstyle", "breakbeat", "rock", "disco"]
}, {
	"name": "electronic",
	"color": "#6666ff",
	"x": -255,
	"y": -255,
	"z": 1275,
	"info": "<p><b>Electronic music</b> is music that employs electronic musical instruments, digital instruments and circuitry-based music technology. In general, a distinction can be made between sound produced using electromechanical means (electroacoustic music), and that produced using electronics only. Electromechanical instruments include mechanical elements, such as strings, hammers, and so on, and electric elements, such as magnetic pickups, power amplifiers and loudspeakers. Examples of electromechanical sound producing devices include the telharmonium, Hammond organ, and the electric guitar, which are typically made loud enough for performers and audiences to hear with an instrument amplifier and speaker cabinet. Pure electronic instruments do not have vibrating strings, hammers, or other sound-producing mechanisms. Devices such as the theremin, synthesizer, and computer can produce electronic sounds.</p><p>The first electronic devices for performing music were developed at the end of the 19th century, and shortly afterward Italian futurists explored sounds that had not been considered musical. During the 1920s and 1930s, electronic instruments were introduced and the first compositions for electronic instruments were made. By the 1940s, magnetic audio tape allowed musicians to tape sounds and then modify them by changing the tape speed or direction, leading to the development of electroacoustic tape music in the 1940s, in Egypt and France. Musique concrète, created in Paris in 1948, was based on editing together recorded fragments of natural and industrial sounds. Music produced solely from electronic generators was first produced in Germany in 1953. Electronic music was also created in Japan and the United States beginning in the 1950s. An important new development was the advent of computers to compose music. Algorithmic composition with computers was first demonstrated in the 1950s (although algorithmic composition per se without a computer had occurred much earlier, for example Mozart's Musikalisches Würfelspiel).\n</p><p>In the 1960s, live electronics were pioneered in America and Europe, Japanese electronic musical instruments began influencing the music industry, and Jamaican dub music emerged as a form of popular electronic music. In the early 1970s, the monophonic Minimoog synthesizer and Japanese drum machines helped popularize synthesized electronic music.\n</p><p>In the 1970s, electronic music began having a significant influence on popular music, with the adoption of polyphonic synthesizers, electronic drums, drum machines, and turntables, through the emergence of genres such as disco, krautrock, new wave, synth-pop, hip hop and EDM. In the 1980s, electronic music became more dominant in popular music, with a greater reliance on synthesizers, and the adoption of programmable drum machines such as the Roland TR-808 and bass synthesizers such as the TB-303. In the early 1980s, digital technologies for synthesizers including digital synthesizers such as the Yamaha DX7 were popularized, and a group of musicians and music merchants developed the Musical Instrument Digital Interface (MIDI).\n</p><p>Electronically produced music became prevalent in the popular domain by the 1990s, because of the advent of affordable music technology.  Contemporary electronic music includes many varieties and ranges from experimental art music to popular forms such as electronic dance music. Today, pop electronic music is most recognizable in its 4/4 form and more connected with the mainstream culture as opposed to its preceding forms which were specialized to niche markets.</p>",
	"links": ["edm", "pop", "breakbeat", "house", "electro", "disco", "dubstep", "trance", "reggae", "rock", "hardstyle"]
}, {
	"name": "emo",
	"color": "#262600",
	"x": -895,
	"y": -895,
	"z": -1275,
	"info": "<p class=\"mw-empty-elt\">\n\n\n</p>\n<p><b>Emo</b> <span></span> is a rock music genre characterized by an emphasis on emotional expression, sometimes through confessional lyrics. It emerged as a style of <span>post-hardcore</span> from the <span>mid-1980s</span> hardcore punk movement in Washington, D.C., where it was known as <b>emotional hardcore</b> or <b>emocore</b> and pioneered by bands such as Rites of Spring and Embrace. In the early–mid 1990s, emo was adopted and reinvented by alternative rock, indie rock and pop punk bands such as Sunny Day Real Estate, Jawbreaker, Weezer and Jimmy Eat World, with Weezer breaking into the mainstream during this time. By the <span>mid-1990s,</span> bands such as Braid, the Promise Ring and the Get Up Kids emerged from the burgeoning Midwest emo scene, and several independent record labels began to specialize in the genre. Meanwhile, screamo, a more aggressive style of emo using screamed vocals, also emerged, pioneered by the San Diego bands Heroin and Antioch Arrow.\n</p><p>Often seen as a subculture, emo also signifies a specific relationship between fans and artists and certain aspects of fashion, culture and behavior. Emo fashion has been associated with skinny jeans; tight <span>t-shirt</span>s with band names; studded belts; and flat, straight, jet-black hair with long bangs. Fans of emo music who dress like this are referred to as \"emo kids\" or \"emos\". Emos are known for listening to emo bands like My Chemical Romance, Hawthorne Heights, The Used, and AFI. The emo subculture is stereotypically associated with emotion, sensitivity, misanthropy, shyness, introversion and angst, as well as depression, <span>self-harm</span> and suicide. Its quick rise in popularity in the early 2000s inspired a backlash, with bands such as My Chemical Romance and Panic! at the Disco rejecting the emo label because of the social stigma and controversy surrounding it.\n</p><p>Emo entered mainstream culture in the early 2000s with the success of Jimmy Eat World and Dashboard Confessional and many artists signed to major record labels. Bands such as My Chemical Romance, AFI, Fall Out Boy and the Red Jumpsuit Apparatus continued the genre's popularity during the rest of the decade. By the early 2010s, emo's popularity waned, with some groups changing their sound and others disbanding. Meanwhile, however, a mainly underground emo revival emerged, with bands such as The World Is a Beautiful Place &amp; I Am No Longer Afraid to Die and Modern Baseball drawing on the sound and aesthetic of 1990s emo.\n</p>\n\n\n",
	"links": ["metalcore", "rock", "punk", "pop"]
}, {
	"name": "folk",
	"color": "#4d1f00",
	"x": -505,
	"y": -965,
	"z": -1275,
	"info": "<p><b>Folk music</b> includes traditional folk music and the genre that evolved from it during the 20th-century folk revival. Some types of folk music may be called world music. Traditional folk music has been defined in several ways: as music transmitted orally, music with unknown composers, or music performed by custom over a long period of time. It has been contrasted with commercial and classical styles. The term originated in the 19th century, but folk music extends beyond that.\n</p><p>Starting in the mid-18th century, a new form of popular folk music evolved from traditional folk music. This process and period is called the (third) folk revival and reached a zenith in the 1960s. This form of music is sometimes called contemporary folk music or folk revival music to distinguish it from earlier folk forms.  Smaller, similar revivals have occurred elsewhere in the world at other times, but the term folk music has typically not been applied to the new music created during those revivals. This type of folk music also includes fusion genres such as folk rock, folk metal, and others. While contemporary folk music is a genre generally distinct from traditional folk music, in Romanian it shares a different name, and it often does not share the same people and animals as traditional music.\n</p>",
	"links": ["singer-songwriter", "rock", "pop", "metal", "bluegrass"]
}, {
	"name": "forro",
	"color": "#008c00",
	"x": -1275,
	"y": 125,
	"z": -1275,
	"info": "<p><b>Forró</b> (<small>Portuguese pronunciation: </small><span title=\"Representation in the International Phonetic Alphabet (IPA)\">[fɔˈʁɔ]</span><sup>*</sup>) is a party originated and typical of Northeastern Region of Brazil. It encompasses various dance types as well as a number of different musical genres.   Their music genres and dances has gained widespread popularity in all regions of Brazil. Forró is more frequent during Brazilian June Festivals.\n</p>",
	"links": ["pagode", "sertanejo", "mpb", "samba"]
}, {
	"name": "french",
	"color": "#33ff00",
	"x": -765,
	"y": 1275,
	"z": -1275,
	"info": "<p>The <b>music of France</b> reflects a diverse array of styles. In the field of classical music, France has produced a number of prominent romantic composers, while folk and popular music have seen the rise of the chanson and cabaret style. The earliest known sound recording device in the world, the phonautograph, was patented in France by Édouard-Léon Scott de Martinville in 1857. France is also the 5th largest market by value in the world, and its music industry has produced many internationally renowned artists, especially in the nouvelle chanson and electronic music.\n</p>",
	"links": ["pop", "electro", "electronic"]
}, {
	"name": "funk",
	"color": "#cc3399",
	"x": 765,
	"y": -765,
	"z": 255,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n\n<p><b>Funk</b> is a music genre that originated in African-American communities in the mid-1960s when African-American musicians created a rhythmic, danceable new form of music through a mixture of soul music, jazz, and rhythm and blues (R&amp;B). Funk de-emphasizes melody and chord progressions and focuses on a strong rhythmic groove of a bass line played by an electric bassist and a drum part played by a drummer. Like much of African-inspired music, funk typically consists of a complex groove with rhythm instruments playing interlocking grooves. Funk uses the same richly colored extended chords found in bebop jazz, such as minor chords with added sevenths and elevenths, or dominant seventh chords with altered ninths and thirteenths.\n</p><p>Funk originated in the mid-1960s, with James Brown's development of a signature groove that emphasized the downbeat—with heavy <i>emphasis on the first beat</i> of every measure (\"The One\"), and the application of swung 16th notes  and syncopation on all bass lines, drum patterns, and guitar riffs. Other musical groups, including Sly and the Family Stone, the Meters, and Parliament-Funkadelic, soon began to adopt and develop Brown's innovations. While much of the written history of funk focuses on men, there have been notable funk women, including Chaka Khan, Labelle, Lyn Collins, Brides of Funkenstein, Klymaxx, Mother's Finest, and Betty Davis.\n</p><p>Funk derivatives include the psychedelic funk eras of Sly Stone and George Clinton; the avant-funk of groups such as Talking Heads and the Pop Group; boogie, a form of post-disco dance music; electro music, a hybrid of electronic music and funk; funk metal (e.g., Living Colour, Faith No More); G-funk, a mix of gangsta rap and funk; Timba, a form of funky Cuban popular dance music; and funk jam (e.g., Phish). Funk samples and breakbeats have been used extensively in hip hop and various forms of electronic dance music, such as house music, old-school rave, breakbeat, and drum and bass. It is also the main influence of go-go, a subgenre associated with funk.</p>",
	"links": ["afrobeat", "soul", "disco", "electro", "rock", "pop"]
}, {
	"name": "garage",
	"color": "#000033",
	"x": -1275,
	"y": -1275,
	"z": -765,
	"info": "<p class=\"mw-empty-elt\">\n\n</p>\n<p><b>Garage rock</b> (sometimes called  <b><span>'</span>60s punk</b> or <b>garage punk</b>) is a raw and energetic style of rock and roll that flourished in the mid-1960s, most notably in the United States and Canada, and has experienced various revivals in the last several decades.  The style is characterized by basic chord structures played on electric guitars and other instruments, sometimes distorted through a fuzzbox, as well as often unsophisticated and occasionally aggressive lyrics and delivery.  The term \"garage rock\" derives from the perception that groups were often made up of young amateurs who rehearsed in the family garage, although many were professional.\n</p><p>In the US and Canada, surf rock—and later the Beatles and other beat groups of the British Invasion—motivated thousands of young people to form bands between 1963 and 1968.  Hundreds of acts produced regional hits, and some had national hits, usually played on AM radio stations.  With the advent of psychedelia, a number of garage bands incorporated exotic elements into the genre's primitive stylistic framework, but after 1968, as more sophisticated forms of rock music came to dominate the marketplace, garage rock records largely disappeared from national and regional charts, and the movement faded.  Though generally associated with North America, other countries in the 1960s developed similar grass-roots rock movements that have sometimes been characterized as variants of garage rock.\n</p><p>During the 1960s garage rock was not recognized as a distinct genre and had no specific name, but critical hindsight in the early 1970s—and particularly the release of the 1972 compilation album <i>Nuggets</i>—did much to define and memorialize the style.  Between 1971 and 1973 certain rock critics began to retroactively identify the music as a genre and for several years used the term \"punk rock\" to describe it, making it the first form of music to bear the description, predating the more familiar use of the term appropriated by the later punk rock movement of the mid- to late-1970s that it influenced.  The term \"garage rock\" came into use at the beginning of the 1980s and eventually gained favor amongst devotees.  The genre has also been referred to as <span>\"</span>'60s punk\", \"garage punk\", or \"proto-punk\".\n</p><p>In the early to mid-1980s, several revival scenes emerged featuring acts that consciously attempted to replicate the look and sound of 1960s garage bands.  Later in the decade, a louder, more contemporary garage subgenre developed that combined garage rock with modern punk rock and other influences, sometimes using the garage punk label originally and otherwise associated with 1960s garage bands.  In the 2000s, a wave of garage-influenced acts associated with the post-punk revival emerged, and some achieved commercial success.  Garage rock continues to appeal to musicians and audiences who prefer a \"back to basics\" or \"do-it-yourself\" musical approach.\n</p>\n\n",
	"links": ["electronic", "rock", "dubstep", "metal", "house", "pop", "dancehall", "punk", "rockabilly", "grunge"]
}, {
	"name": "german",
	"color": "#808046",
	"x": 5,
	"y": 5,
	"z": -575,
	"info": "<p>Germany claims some of the most renowned composers, singers, producers and performers of the world. Germany is the largest music market in Europe, and third largest in the world.</p><p>German Classical is one of the most performed in the world; German composers include some of the most accomplished and popular in history, among them Johann Sebastian Bach, Georg Friedrich Händel, Ludwig van Beethoven, Felix Mendelssohn, Johannes Brahms, Robert Schumann and Richard Wagner. Wolfgang Amadeus Mozart (also recognized as Austrian) was among the composers who created the field of German opera.  One of the most famous film score composers is Hans Zimmer.\n</p><p>German popular music of the 20th and 21st century includes the movements of Neue Deutsche Welle (Nena, Alphaville), Disco (Boney M., Modern Talking, Dschinghis Khan, Milli Vanilli, Bad Boys Blue), Metal/Rock (Rammstein, Scorpions, Accept, Helloween), Punk (Die Ärzte, Böhse Onkelz, Nina Hagen, Die Toten Hosen), Pop rock (Herbert Grönemeyer) and Indie (Tocotronic). Famous female singers were Marlene Dietrich and Hildegard Knef. German Electronic music gained global influence, with Kraftwerk and Tangerine Dream being pioneer groups in this genre.  The Electro and Techno scene being internationally popular with Paul van Dyk and Scooter.\n</p><p>Germany hosts many large rock music festivals annually. The Rock am Ring festival and the Wacken Open Air are among the largest in the world.  Since about 1990 the new-old German capital Berlin has developed a diverse music and entertainment industry.\n</p>",
	"links": ["edm", "pop", "electronic", "rock"]
}, {
	"name": "gospel",
	"color": "#009900",
	"x": -1275,
	"y": 255,
	"z": -1275,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n<p><b>Gospel music</b> is a genre of Christian music. The creation, performance, significance, and even the definition of gospel music varies according to culture and social context. Gospel music is composed and performed for many purposes, including aesthetic pleasure, religious or ceremonial purposes, and as an entertainment product for the marketplace. Gospel music usually has dominant vocals (often with strong use of harmony) with Christian lyrics. Gospel music can be traced to the early 17th century, with roots in the black oral tradition. Hymns and sacred songs were often repeated in a call and response fashion. Most of the churches relied on hand clapping and foot stomping as rhythmic accompaniment. Most of the singing was done a cappella. The first published use of the term \"gospel song\" probably appeared in 1874. The original gospel songs were written and composed by authors such as George F. Root, Philip Bliss, Charles H. Gabriel, William Howard Doane, and Fanny Crosby. Gospel music publishing houses emerged. The advent of radio in the 1920s greatly increased the audience for gospel music. Following World War II, gospel music moved into major auditoriums, and gospel music concerts became quite elaborate.</p><p>Gospel blues is a blues-based form of gospel music (a combination of blues guitar and evangelistic lyrics). Southern gospel used all male, tenor-lead-baritone-bass quartet make-up. Progressive Southern gospel is an American music genre that has grown out of Southern gospel over the past couple of decades. Christian country music, sometimes referred to as country gospel music, is a subgenre of gospel music with a country flair. It peaked in popularity in the mid-1990s.\n</p><p>Bluegrass gospel music is rooted in American mountain music. Celtic gospel music infuses gospel music with a Celtic flair, and is quite popular in countries such as Ireland. British black gospel refers to Gospel music of the African diaspora, which has been produced in the UK. Some proponents of \"standard\" hymns generally dislike gospel music of the late 19th and early 20th centuries. Today, with historical distance, there is a greater acceptance of such gospel songs into official denominational hymnals.\n</p>",
	"links": []
}, {
	"name": "goth",
	"color": "#170817",
	"x": -1045,
	"y": -1195,
	"z": -1045,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n\n<p><b>Gothic rock</b> (alternately called <b>goth-rock</b> or <b>goth</b>) is a style of rock music that emerged from post-punk in the late 1970s. The first post-punk bands which shifted towards dark music with gothic overtones include Siouxsie and the Banshees, Joy Division, Bauhaus, and the Cure.</p><p>The genre itself was defined as a separate movement from post-punk due to its darker music accompanied by introspective and romantic lyrics. Gothic rock then gave rise to a broader subculture that included clubs, fashion and publications in the 1980s.\n</p>",
	"links": ["metal", "industrial", "punk", "rock", "blues", "funk", "soul"]
}, {
	"name": "grindcore",
	"color": "#080308",
	"x": -1195,
	"y": -1245,
	"z": -1195,
	"info": "<p><b>Grindcore</b> is an extreme fusion genre of heavy metal and hardcore punk that originated in the mid-1980s, drawing inspiration from abrasive-sounding musical styles, such as: thrashcore, crust punk, hardcore punk, extreme metal and industrial. Grindcore is characterized by a noise-filled sound that uses heavily distorted, down-tuned guitars, grinding overdriven bass, high speed tempo, blast beats, and vocals which consist of growls and high-pitched shrieks. Early groups like Napalm Death are credited with laying the groundwork for the style. It is most prevalent today in North America and Europe, with popular contributors such as Brutal Truth and Nasum. Lyrical themes range from a primary focus on social and political concerns, to gory subject matter and black humor.\n</p><p>A trait of grindcore is the \"microsong\". Several bands have produced songs that are only seconds in length. British band Napalm Death holds the Guinness World Record for shortest song ever recorded with the one-second \"You Suffer\" (1987). Many bands, such as Agoraphobic Nosebleed, record simple phrases that may be rhythmically sprawled out across an instrumental lasting only a couple of bars in length.\n</p><p>A variety of microgenres have subsequently emerged, often labeling bands according to traits that deviate from regular grindcore, including goregrind, focused on themes of gore (e.g. mutilation and pathology), and pornogrind, fixated on pornographic lyrical themes. Another offshoot is electrogrind (or cybergrind) which incorporates electronic music elements such as sampling and programmed drums. Although influential within hardcore and extreme metal, grindcore remains an underground form of music.\n</p>",
	"links": ["metal"]
}, {
	"name": "groove",
	"color": "#bd7a63",
	"x": 615,
	"y": -55,
	"z": -285,
	"info": "<p>In music, <b>groove</b> is the sense of propulsive rhythmic \"feel\" or sense of \"swing\". In jazz, it can be felt as a persistently repeated pattern. It can be created by the interaction of the music played by a band's rhythm section (e.g. drums, electric bass or double bass, guitar, and keyboards). Groove is a significant feature of popular music, and can be found in many genres, including salsa, funk, rock, fusion, and soul.\n</p>\n\n<p>From a broader ethnomusicological perspective, groove has been described as \"an unspecifiable but ordered sense of something that is sustained in a distinctive, regular and attractive way, working to draw the listener in.\"  Musicologists and other scholars have analyzed the concept of \"groove\" since around the 1990s. They have argued that a \"groove\" is an \"understanding of rhythmic patterning\" or \"feel\" and \"an intuitive sense\" of \"a cycle in motion\" that emerges from \"carefully aligned concurrent rhythmic patterns\" that stimulates dancing or foot-tapping on the part of listeners. The concept can be linked to the sorts of ostinatos that generally accompany fusions and dance musics of African derivation (e.g. African-American, Afro-Cuban, Afro-Brazilian, etc.).</p><p>The term is often applied to musical performances that make one want to move or dance, and enjoyably \"groove\" (a word that also has sexual connotations). The expression \"in the groove\" (as in the jazz standard) was widely used from around 1936 to 1945, at the height of the swing era,  to describe top-notch jazz performances. In the 1940s and 1950s, groove commonly came to denote musical \"routine, preference, style, [or] source of pleasure.\"</p>",
	"links": ["funk", "soul", "disco", "pop", "rockabilly", "rock", "blues", "folk", "afrobeat"]
}, {
	"name": "grunge",
	"color": "#0a0008",
	"x": -1175,
	"y": -1275,
	"z": -1195,
	"info": "<p class=\"mw-empty-elt\">\n\n</p>\n<p><b>Grunge</b> (sometimes referred to as the <b>Seattle sound</b>) is the music genre formed from the fusion of punk rock and heavy metal, and a subculture that emerged during the <span>mid-1980s</span> in the Pacific Northwest U.S. state of Washington, particularly in Seattle and nearby towns. The early grunge movement revolved around Seattle's independent record label Sub Pop and the region's underground music scene. By the early 1990s its popularity had spread, with grunge bands appearing in California, then emerging in other parts of the United States and in Australia, building strong followings and signing major record deals.\n</p><p>Grunge was commercially successful in the early to mid-1990s, due to releases such as Nirvana's <i>Nevermind</i>, Pearl Jam's <i>Ten</i>, Soundgarden's <i>Badmotorfinger</i>, Alice in Chains' <i>Dirt</i> and Stone Temple Pilots' <i>Core</i>. The success of these bands boosted the popularity of alternative rock and made grunge the most popular form of rock music at the time Although most grunge bands had disbanded or faded from view by the late 1990s, they influenced modern rock music, as their lyrics brought socially conscious issues into pop culture and added introspection and an exploration of what it means to be true to oneself. Grunge was also an influence on later genres such as post-grunge (such as Creed and Nickelback) and nu metal (such as Korn and Limp Bizkit).\n</p><p>Grunge fuses elements of punk rock,  and heavy metal, such as the distorted electric guitar used in both genres, although some bands performed with more emphasis on one or the other. Like these genres, grunge typically uses electric guitar, bass guitar, a drummer and a singer. Grunge also incorporates influences from indie rock bands such as Sonic Youth. Lyrics are typically angst-filled and introspective, often addressing themes such as social alienation, self-doubt, abuse, neglect, betrayal, social and emotional isolation, psychological trauma and a desire for freedom.</p><p>A number of factors contributed to grunge's decline in prominence. During the <span>mid-to-late 1990s</span>, many grunge bands broke up or became less visible. Nirvana's Kurt Cobain, labeled by <i>Time</i> as \"the John Lennon of the swinging Northwest\", appeared unusually tortured by success and struggled with an addiction to heroin before he died by suicide at the age of 27 in 1994.\n</p>",
	"links": ["rock", "punk"]
}, {
	"name": "guitar",
	"color": "#c2c229",
	"x": 665,
	"y": 665,
	"z": -865,
	"info": "Music in which a guitar is dominant",
	"links": ["rock", "metal", "blues", "funk", "grunge", "folk", "singer-songwriter", "electronic", "rockabilly", "soul", "punk", "pop", "emo"]
}, {
	"name": "happy",
	"color": "#baba2e",
	"x": 585,
	"y": 585,
	"z": -815,
	"info": "Music which is made to make the listener feel happy.",
	"links": ["pop", "rock", "electronic", "edm", "house", "disco", "funk", "soul", "folk", "singer-songwriter", "reggae", "emo", "latin"]
}, {
	"name": "hard-rock",
	"color": "#191919",
	"x": -1025,
	"y": -1025,
	"z": -1025,
	"info": "<p><b>Hard rock</b> is a loosely defined subgenre of rock music that began in the mid-1960s, with the garage, psychedelic and blues rock movements. It is typified by a heavy use of aggressive vocals, distorted electric guitars, bass guitar, drums, and often accompanied with keyboards.\n</p><p>Hard rock developed into a major form of popular music in the 1970s, with notable bands such as AC/DC, the Who, Led Zeppelin, Queen, Deep Purple, Aerosmith, Kiss and Van Halen. During the 1980s, some hard rock bands moved away from their hard rock roots and more towards pop rock, while others began to return to a hard rock sound. Established bands made a comeback in the mid-1980s and it reached a commercial peak in the 1980s, with glam metal bands like Bon Jovi and Def Leppard and the rawer sounds of Guns N' Roses, which followed up with great success in the later part of that decade. Hard rock began losing popularity with the commercial success of R&amp;B, hip-hop, urban pop, grunge and later Britpop in the 1990s.\n</p><p>Despite this, many post-grunge bands adopted a hard rock sound and in the 2000s there came a renewed interest in established bands, attempts at a revival, and new hard rock bands that emerged from the garage rock and post-punk revival scenes. Out of this movement came garage rock bands like the White Stripes, the Strokes, Interpol and, later on, the Black Keys. In the 2000s, only a few hard rock bands from the 1970s and 1980s managed to sustain highly successful recording careers.\n</p>\n\n\n",
	"links": ["rock", "metal", "grunge"]
}, {
	"name": "hardcore",
	"color": "#0d0d0d",
	"x": -1145,
	"y": -1145,
	"z": -1145,
	"info": "<p><b>Hardcore</b> (also known as <b>hardcore techno</b>) is a subgenre of electronic dance music that originated in the Netherlands from the emergent raves/gabber in the 1990s. Its subgenres are usually distinguished from other electronic dance music genres by faster tempos (160 to 200 BPM or more), the intensity of the kicks and the synthesized bass (in some subgenres), the rhythm and the atmosphere of the themes (sometimes violent), the usage of saturation and experimentation close to that of industrial dance music.\n</p>\n\n\n",
	"links": ["grunge", "punk", "ska", "rock", "metalcore", "metal", "emo"]
}, {
	"name": "hardstyle",
	"color": "#000026",
	"x": -1275,
	"y": -1275,
	"z": -895,
	"info": "<p><b>Hardstyle</b> is an electronic dance genre mixing influences from techno and hardcore. Early hardstyle typically consisted of an overdriven and hard-sounding kick drum with a lot of sustain, with intense faded or reversed basslines accompanying the beat.  Hardstyle also utilises harsh and distorted synths, detuned and distorted sounds accompanying the main instruments along with a lot of modern hardstyle songs that also incorporate poetry and story telling within the music.\n</p><p>The natural evolution of music has seen hardstyle mellow out over time. What was once a very dark, assertive and powerful genre began to incorporate trance-like synths and uplifting melodies. Modern kicks are also now layered, with multiple layers of higher frequency distorted kicks, combining with a lower frequency tremble to create a thicker and fuller kick drum. During the mid-late 2000s, pitching kicks became popular in hardstyle as well, and all this has led to hardstyle becoming more accessible and popularity increased. Many hardcore artists produce hardstyle tracks as well, and many newer Hardstyle tracks are written in compound time (for example, older Headhunterz and Noisecontrollers work).</p><p>Hardstyle has also been an influence on other styles of electronic dance music as well, most notably big room house, that shares similarities with hardstyle, like structures, rhythms and later pitched kicks.\n</p>",
	"links": ["edm"]
}, {
	"name": "heavy-metal",
	"color": "#00001a",
	"x": -1275,
	"y": -1275,
	"z": -1015,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n<p><b>Heavy metal</b> (or simply <b>metal</b>) is a genre of rock music that developed in the late 1960s and early 1970s, largely in the United Kingdom. With roots in blues rock, psychedelic rock, and acid rock, the bands that created heavy metal developed a thick, massive sound, characterized by highly amplified distortion, extended guitar solos, emphatic beats, and overall loudness. The genre's lyrics and performance styles are sometimes associated with aggression and machismo.</p><p>In 1968, three of the genre's most famous pioneers, Led Zeppelin, Black Sabbath and Deep Purple were founded. Though they came to attract wide audiences, they were often derided by critics. During the mid-1970s, Judas Priest helped spur the genre's evolution by discarding much of its blues influence; Motörhead introduced a punk rock sensibility and an increasing emphasis on speed. Beginning in the late 1970s, bands in the new wave of British heavy metal such as Iron Maiden and Saxon followed in a similar vein. Before the end of the decade, heavy metal fans became known as \"metalheads\" or \"headbangers\".\n</p><p>During the 1980s, glam metal became popular with groups such as Mötley Crüe, Poison and Def Leppard. Underground scenes produced an array of more aggressive styles: thrash metal broke into the mainstream with bands such as Metallica, Slayer, Megadeth, and Anthrax, while other extreme subgenres of heavy metal such as death metal (with bands such as Death, Possessed, and Obituary) and black metal (with bands such as Mayhem, Bathory, and Immortal) remain subcultural phenomena. Since the mid-1990s popular styles have further expanded the definition of the genre. These include groove metal (with bands such as Pantera, Sepultura, and Lamb of God) and nu metal (with bands such as Korn, Slipknot, and Linkin Park), the latter of which often incorporates elements of grunge and hip hop.\n</p>",
	"links": ["metal", "rock", "metalcore", "hardcore"]
}, {
	"name": "hip-hop",
	"color": "#969600",
	"x": 225,
	"y": 225,
	"z": -1275,
	"info": "<p class=\"mw-empty-elt\">\n\n</p>\n\n\n<p><b>Hip hop music</b>,  also called <b>hip-hop</b> or <b>rap music</b>, is a music genre developed in the United States by inner-city African Americans in the late 1970s which consists of a stylized rhythmic music that commonly accompanies rapping, a rhythmic and rhyming speech that is chanted. It developed as part of hip hop culture, a subculture defined by four key stylistic elements: MCing/rapping, DJing/scratching with turntables, break dancing, and graffiti writing.  Other elements include sampling beats or bass lines from records (or synthesized beats and sounds), and rhythmic beatboxing. While often used to refer solely to rapping, \"hip hop\" more properly denotes the practice of the entire subculture. The term <i>hip hop music</i> is sometimes used synonymously with the term <i>rap music</i>, though rapping is not a required component of hip hop music; the genre may also incorporate other elements of hip hop culture, including DJing, turntablism, scratching, beatboxing, and instrumental tracks.</p>",
	"links": ["pop", "rock", "edm", "electro", "funk"]
}, {
	"name": "holidays",
	"color": "#990099",
	"x": 255,
	"y": -1275,
	"z": 255,
	"info": "<p><b>Christmas music</b> comprises a variety of genres of music normally performed or heard around the Christmas season. Music associated with Christmas may be purely instrumental, or in the case of many carols or songs may employ lyrics whose subject matter ranges from the nativity of Jesus Christ, to gift-giving and merrymaking, to cultural figures such as Santa Claus, among other topics. Performances of Christmas music at public concerts, in churches, at shopping malls, on city streets, and in private gatherings is an integral staple of the Christmas holiday in many cultures across the world.\n</p><p>Music associated with Christmas is thought to have its origins in 4th-century Rome, in Latin-language hymns such as <i>Veni redemptor gentium</i>. By the 13th century, under the influence of Francis of Assisi, the tradition of popular Christmas songs in regional native languages developed. Christmas carols in the English language first appear in a 1426 work of John Awdlay, an English chaplain, who lists twenty five \"<i>caroles of Cristemas</i>\", probably sung by groups of 'wassailers' who would travel from house to house. In the 16th century, various Christmas carols still sung to this day, including \"The 12 Days of Christmas\", \"God Rest You Merry, Gentlemen\", and \"O Christmas Tree\", first emerged.</p><p>The Victorian Era saw a surge of Christmas carols associated with a renewed admiration of the holiday, including \"Silent Night\", \"O Little Town of Bethlehem\", and \"O Holy Night\". The first Christmas songs associated with Saint Nicholas or other gift-bringers also came during 19th century, including \"Up on the Housetop\" and \"Jolly Old St. Nicholas\". Many older Christmas hymns were also translated or had lyrics added to them during this period, particularly in 1871 when John Stainer published a widely influential collection entitled \"<i>Christmas Carols New &amp; Old</i>\". Few notable carols were produced from the beginning of the 20th century until the Great Depression era of the 1930s, when a stream of songs of often American origin were published, most of which did not explicitly reference the Christian nature of the holiday, but rather the more secular traditional Western themes and customs associated with Christmas. These included songs aimed at children such as \"Santa Claus Is Comin' to Town\" and \"Rudolph the Red-Nosed Reindeer\", as well as sentimental ballad-type songs performed by famous crooners of the era, such as \"Have Yourself a Merry Little Christmas\" and \"White Christmas\", the latter of which remains the best-selling single of all time as of 2018.</p><p>Popular Christmas music produced from after World War II until the present day has generally remained thematically, lyrically, and instrumentally similar to the songs produced in the early 20th century. Since the dawn of the rock era in the mid-1950s, much of the Christmas music produced for popular audiences has had explicitly romantic overtones, only using Christmas as a setting. The 1950s also featured the introduction of novelty songs that used the holiday as a target for satire and source for comedy. Exceptions such as \"The Christmas Shoes\" (2000) have re-introduced Christian themes as complementary to the secular Western themes, and a plethora of traditional carol cover versions by various artists have explored virtually all music genres.\n</p>",
	"links": ["rockabilly", "jazz", "soul", "folk", "singer-songwriter", "disco", "funk", "opera"]
}, {
	"name": "honky-tonk",
	"color": "#bd5963",
	"x": 615,
	"y": -385,
	"z": -285,
	"info": "<p>A <b>honky-tonk</b> (also called <b>honkatonk</b>, <b>honkey-tonk</b>, or <b>tonk</b>) is both a bar that provides country music for the entertainment of its patrons and the style of music played in such establishments. Bars of this kind are common in the South and Southwest United States. Many eminent country music artists, such as Jimmie Rodgers, Loretta Lynn, Patsy Cline, Ernest Tubb, Johnny Horton and Merle Haggard, began their careers as amateur musicians in honky-tonks.  The modern-day, honky-tonk atmosphere has continued, with the likes of Dwight Yoakam, Turnpike Troubadours, and Mike and the Moonpies.</p><p>The origin of the term <i>honky-tonk</i> is disputed, originally referring to bawdy variety shows in areas of the old West (Oklahoma, the Indian Territories and Texas) and to the actual theaters showing them.\n</p><p>The first music genre to be commonly known as honky-tonk was a style of piano playing related to ragtime but emphasizing rhythm more than melody or harmony; the style evolved in response to an environment in which pianos were often poorly cared for, tending to be out of tune and having some nonfunctioning keys. This honky-tonk music was an important influence on the boogie-woogie piano style. Before World War II, the music industry began to refer to hillbilly music being played from Texas and Oklahoma to the West Coast as \"honky-tonk\" music. In the 1950s, honky-tonk entered its golden age, with the popularity of Webb Pierce, Hank Locklin, Lefty Frizzell, Ray Price, Faron Young, George Jones, and Hank Williams.\n</p>",
	"links": ["country", "folk", "rockabilly", "pop", "singer-songwriter"]
}, {
	"name": "house",
	"color": "#8080ff",
	"x": 5,
	"y": 5,
	"z": 1275,
	"info": "<p><b>House music</b> is a genre of electronic dance music created by club DJs and music producers in Chicago in the early 1980s. Early house music was generally characterized by repetitive 4/4 beats, rhythms provided by drum machines, off-beat hi-hat cymbals, and synthesized basslines. While house displayed several characteristics similar to disco music, which preceded and influenced it, as both were DJ and record producer-created dance music, house was more electronic and minimalistic. The mechanical, repetitive rhythm of house was one of its main components. Many house songs were instrumental, with no vocals; some had singing throughout the song with lyrics; and some had singing but no actual words.\n</p><p>House music developed in Chicago's underground dance club culture in the early 1980s, as DJs from the subculture began altering the pop-like disco dance tracks to give them a more mechanical beat and deeper basslines. As well, these DJs began to mix synth pop, rap, Latin, and even jazz into their tracks. Latin music, particularly salsa clave rhythm, became a dominating riff of house music. It was pioneered by Chicago DJs such as  Chip E., and Steve Hurley. It was influenced by Chicago DJ and record producer Frankie Knuckles, the Chicago acid-house electronic music group Phuture, the Tennessee DJ/producer Mr. Fingers, and US-born, UK-based singer Kym Mazelle. The genre was originally associated with Hispanic and Black American LGBT subcultures but has spread to the mainstream. From its beginnings in the Chicago club and local radio scene, the genre spread internationally to London, then to American cities such as New York City and Detroit, and eventually globally.</p><p>Chicago house music acts from the early to mid-1980s found success on the US dance charts on various Chicago independent record labels that were more open to sign local house music artists. These same acts also experienced some success in the United Kingdom, garnering hits in that country. Due to this success, by the late 1980s, Chicago house music acts suddenly found themselves being offered major label deals. House music proved to be a commercially successful genre and a more mainstream pop-based variation grew increasingly popular. Since the early to mid-1990s, house music has been infused into mainstream pop and dance music worldwide. In the 2010s, the genre, while keeping several of its core elements, notably the prominent kick drum on most beats, varies widely in style and influence, ranging from soulful and atmospheric to the more minimalistic microhouse. House music has also fused with several other genres creating fusion subgenres, such as euro house, tech house, electro house and jump house. One subgenre, acid house, was based around the squelchy, deep electronic tones created by Roland's TB-303 bass synthesizer.\n</p><p>Major acts such as Madonna, Janet Jackson, Paula Abdul, CeCe Peniston, Bananarama, Robin S., Steps, Kylie Minogue, Björk, and C+C Music Factory to name a few, were all influenced by House Music in the 1990s and beyond. After enjoying significant success which started in the late 1980s, house music grew even larger during the second wave of progressive house (1999–2001). The genre has remained popular and fused into other popular subgenres, notably ghetto house, deep house, future house and tech house. As of today, house music remains popular on radio and in clubs while retaining a foothold on the underground scenes across the globe.\n</p>",
	"links": ["edm", "pop", "trance", "dubstep", "electro", "rock", "dancehall", "hardstyle"]
}, {
	"name": "idm",
	"color": "#8c8cff",
	"x": 125,
	"y": 125,
	"z": 1275,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n<p><b>Intelligent dance music</b> (commonly abbreviated as <b>IDM</b>) is a form of electronic music originating in the early 1990s. Relative to other forms of electronic and rave music, IDM came to be characterized as better suited to home listening than dancing. Inspired by a variety of sources, including Detroit techno, acid house, ambient music, and breakbeat, IDM tended to rely upon individualistic experimentation rather than adhering to characteristics associated with specific genres.  Prominent artists associated with the genre include Aphex Twin, μ-Ziq, the Black Dog, the Orb, the Future Sound of London, Autechre, Luke Vibert, Squarepusher, Venetian Snares and Boards of Canada.</p><p>The term \"intelligent dance music\" has been widely criticised and rejected by artists associated with the style, including Aphex Twin and µ-Ziq, as elitist and derogatory towards other genres. The term is said to have originated in the US  in 1993 with the formation of the \"IDM list\", an electronic mailing list originally chartered for the discussion of a number of prominent English artists appearing on the 1992 Warp compilation <i>Artificial Intelligence</i>. In 2014, music critic Sasha Frere-Jones observed that the term \"is widely reviled but still commonly used\".</p>",
	"links": ["ambient", "electronic", "electro", "industrial", "techno"]
}, {
	"name": "indian",
	"color": "#cccc33",
	"x": 765,
	"y": 765,
	"z": -765,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n<p>The <b>music of India</b> includes multiple varieties of classical music, folk music, filmi, Indian rock and Indian pop. India's classical music tradition, including Hindustani music and Carnatic, has a history spanning millennia and developed over several areas. Music in India began as an integral part of socio-religious life.\n</p>",
	"links": ["pop"]
}, {
	"name": "indie",
	"color": "#808000",
	"x": 5,
	"y": 5,
	"z": -1275,
	"info": "<p><b>Independent music</b> (often referred to as <b>indie music</b> or <b>indie</b>) is music produced independently from commercial record labels or their subsidiaries, a process that may include an autonomous, do-it-yourself approach to recording and publishing. The term <i>indie</i> is sometimes used to describe a genre (such as indie rock and indie pop), and as a genre term, \"indie\" may include music that is not independently produced, and many independent music artists do not fall into a single, defined musical style or genre and create self-published music that can be categorized into diverse genres.</p>\n\n\n",
	"links": ["pop", "emo", "rock", "funk", "electronic", "house", "punk", "grunge", "singer-songwriter"]
}, {
	"name": "indie-pop",
	"color": "#999900",
	"x": 255,
	"y": 255,
	"z": -1275,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n<p><b>Indie pop</b> (also typeset as <b>indie-pop</b> or <b>indiepop</b>) is a music genre and subculture that combines guitar pop with DIY ethic in opposition to the style and tone of mainstream pop music. It originated from British post-punk in the late 1970s and subsequently generated a thriving fanzine, label, and club and gig circuit. Compared to its counterpart, indie rock, the genre is more melodic, less abrasive, and relatively angst-free. In later years, the definition of <i>indie pop</i> has bifurcated to also mean bands from unrelated DIY scenes/movements with pop leanings. Subgenres include chamber pop and twee pop.</p>",
	"links": ["electronic", "rock", "pop"]
}, {
	"name": "industrial",
	"color": "#000073",
	"x": -1275,
	"y": -1275,
	"z": -125,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n<p><b>Industrial music</b> is a genre of experimental music which draws on harsh, transgressive or provocative sounds and themes. AllMusic defines industrial music as the \"most abrasive and aggressive fusion of rock and electronic music\"; \"initially a blend of avant-garde electronics experiments (tape music, musique concrète, white noise, synthesizers, sequencers, etc.) and punk provocation\". The term was coined in the mid-1970s with the founding of Industrial Records by members of Throbbing Gristle and Monte Cazazza. While the genre name originated with Throbbing Gristle's emergence in the United Kingdom, concentrations of artists and labels vital to the genre also emerged in Chicago.\n</p><p>The first industrial artists experimented with noise and aesthetically controversial topics, musically and visually, such as fascism, sexual perversion, and the occult. Prominent industrial musicians include Throbbing Gristle, Monte Cazazza, SPK, Boyd Rice, Cabaret Voltaire, and Z'EV. On Throbbing Gristle's debut album <i>The Second Annual Report</i>, they coined the slogan \"industrial music for industrial people\". Chicago-based independent label Wax Trax Records featured a heavy roster of industrial music acts. The precursors that influenced the development of the genre included acts such as electronic music group Kraftwerk, experimental rock acts such as Pink Floyd and Frank Zappa, psychedelic rock artists such as Jimi Hendrix, and composers such as John Cage. Musicians also cite writers such as William S. Burroughs, and philosophers such as Friedrich Nietzsche as influences.\n</p><p>While the term was self-applied by a small coterie of groups and individuals associated with Industrial Records in the late 1970s, it was broadened to include artists influenced by the original movement or using an \"industrial\" aesthetic. A few years later in the 1980s, artists on Chicago-based Wax Trax Records such as Front 242, KMFDM, Front Line Assembly, Ministry, and Sister Machine Gun gained prominence on the industrial music scene. Over time, the genre's influence spread into and blended with styles including ambient and rock, all of which now fall under the post-industrial music label. Electro-industrial music is a primary subgenre that developed in the 1980s. The two other most notable hybrid genres are industrial rock and industrial metal, which include bands such as Nine Inch Nails and Ministry, both of which released platinum-selling albums in the 1990s. These distinct genres are often referred to as simply <i>industrial</i>.\n</p>",
	"links": ["electro", "electronic", "rock"]
}, {
	"name": "iranian",
	"color": "#242424",
	"x": -915,
	"y": -915,
	"z": -915,
	"info": "<p>The <b>music of Iran</b> encompasses music that is produced by Iranian artists. In addition to the traditional folk and classical genres, it also includes pop and internationally-celebrated styles such as jazz, rock, and hip hop.\n</p><p>Iranian music influenced other cultures in West Asia, building up much of the musical terminology of the neighboring Turkic and Arabic cultures, and reached India through the 16th-century Persianate Mughal Empire, whose court promoted new musical forms by bringing Iranian musicians.</p>",
	"links": ["metal", "rock"]
}, {
	"name": "j-dance",
	"color": "#59a400",
	"x": -385,
	"y": 365,
	"z": -1275,
	"info": "Dance music from Japan",
	"links": ["j-pop", "j-rock", "j-idol", "k-pop", "anime", "electro", "edm", "pop"]
}, {
	"name": "j-idol",
	"color": "#66ab00",
	"x": -255,
	"y": 435,
	"z": -1275,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n\n\n\n\n\n<p>In Japanese pop culture \"idol\"<span> (<span lang=\"ja\">アイドル</span><span>,</span> <i>aidoru</i>, a Japanese rendering of the English word \"idol\")</span> is a term typically used to refer to young manufactured stars/starlets marketed to be admired for their cuteness. Idols are intended to be role models. They are supposed to maintain a good public image and be good examples for young people. Idols aim to play a wide range of roles as media personalities (<i>tarento</i>): e.g. pop singers, panelists of variety programs, bit-part actors, models for magazines and advertisements.</p><p>The term is commercialized by Japanese talent agencies, that hold auditions for boys and girls with little or no prior experience in the entertainment industry, often as aspiring stars/starlets to be adored for their sweetness and innocence with the intent of creating a passionate following. Most idol singers work across genres of Japanese pop music, usually in the genre that is most popular at the moment, but since many idols sing cute sentimental songs, one can say that those kind of idols form a sort of music genre of their own. Their songs typically do not require great singing skills; their popular appeal comes largely from the attractiveness of their public image. Idols are often not considered \"serious\" musicians or \"serious\" actors. Consequently, many young stars now reject the idol label in their desire to be seen as professionals rather than as objects of fanatical devotion.</p><p>Many Japanese people who are fans of male and female idols see them as akin to sisters/brothers or girl next door/boy next door types; they empathize with the idols and love the way in which they are presented as ordinary people who happened to become popular, enthusiastically following their growth from inexperienced amateurs to famous experienced artists.</p><p>The biggest annual idol concert festival is the Tokyo Idol Festival (TIF) held since 2010. More than 200 idol groups and about 1500 idols performed, attracting more than 80,000 spectators in 2017.\n</p>",
	"links": ["anime", "j-pop", "j-rock", "metal", "rock"]
}, {
	"name": "j-pop",
	"color": "#007300",
	"x": -1275,
	"y": -125,
	"z": -1275,
	"info": "<p><b>J-pop</b> (Japanese: <span lang=\"ja\">ジェイポップ</span> <i>jeipoppu</i>; often stylized as <b>J-POP</b>; an abbreviation for <b>Japanese pop</b>), natively also known simply as <b>pops</b><span> (<span lang=\"ja\">ポップス</span><span>,</span> <i>poppusu</i>)</span>, is a musical genre that entered the musical mainstream of Japan in the 1990s. Modern J-pop has its roots in traditional Japanese music, but significantly in 1960s pop and rock music, such as The Beatles and The Beach Boys, which led to Japanese rock bands such as Happy End fusing rock with Japanese music in the early 1970s. J-pop was further defined by new wave groups in the late 1970s, particularly electronic synth-pop band Yellow Magic Orchestra and pop rock band Southern All Stars.</p><p>Eventually, J-pop replaced <i>kayōkyoku</i> (\"Lyric Singing Music\", a term for Japanese pop music from the 1920s to the 1980s) in the Japanese music scene. The term was coined by the Japanese media to distinguish Japanese music from foreign music and now refers to most Japanese popular music. Popular styles of Japanese pop music included technopop during the 1970s–1980s, city pop in the 1980s, and Shibuya-kei in the 1990s.\n</p>\n\n\n",
	"links": ["anime", "j-rock", "j-dance", "j-idol", "ska", "k-pop", "pop"]
}, {
	"name": "j-rock",
	"color": "#005900",
	"x": -1275,
	"y": -385,
	"z": -1275,
	"info": "<p><b>Japanese rock</b><span> (Japanese: <span lang=\"ja\">日本のロック</span><span>,</span> Hepburn: <i>Nihon no Rokku</i>)</span>, sometimes abbreviated to <b>J-rock</b><span> (<span lang=\"ja\">ジェイ・ロック</span><span>,</span> <i>Jei Rokku</i>)</span>, is rock music from Japan. Influenced by American and British rock of the 1960s, the first rock bands in Japan performed what is called Group Sounds, with lyrics almost exclusively in English. Folk rock band Happy End in the early 1970s are credited as the first to sing rock music in the Japanese language. Punk rock bands Boøwy, The Blue Hearts and hard rock-heavy metal groups B'z, X Japan, led Japanese rock bands in the late 1980s and early 1990s by achieving major mainstream success. Japanese rock music has become a cult worldwide, being widely known in Asia and has survived through decades competing with its contemporary derivative local style J-pop.\n</p>",
	"links": ["j-pop", "j-dance", "anime", "ska", "j-idol", "metalcore"]
}, {
	"name": "jazz",
	"color": "#800080",
	"x": 5,
	"y": -1275,
	"z": 5,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n\n<p><b>Jazz</b> is a music genre that originated in the African-American communities of New Orleans, United States, in the late 19th and early 20th centuries, and developed from roots in blues and ragtime. Jazz is seen by many as \"America's classical music\". Since the 1920s Jazz Age, jazz has become recognized as a major form of musical expression. It then emerged in the form of independent traditional and popular musical styles, all linked by the common bonds of African-American and European-American musical parentage with a performance orientation. Jazz is characterized by swing and blue notes, call and response vocals, polyrhythms and improvisation. Jazz has roots in West African cultural and musical expression, and in African-American music traditions including blues and ragtime, as well as European military band music. Intellectuals around the world have hailed jazz as \"one of America's original art forms\".</p><p>As jazz spread around the world, it drew on different national, regional, and local musical cultures, which gave rise to many distinctive styles. New Orleans jazz began in the early 1910s, combining earlier brass-band marches, French quadrilles, biguine, ragtime and blues with collective polyphonic improvisation. In the 1930s, heavily arranged dance-oriented swing big bands, Kansas City jazz, a hard-swinging, bluesy, improvisational style and Gypsy jazz (a style that emphasized musette waltzes) were the prominent styles. Bebop emerged in the 1940s, shifting jazz from danceable popular music toward a more challenging \"musician's music\" which was played at faster tempos and used more chord-based improvisation. Cool jazz developed near the end of the 1940s, introducing calmer, smoother sounds and long, linear melodic lines.\n</p><p>The 1950s saw the emergence of free jazz, which explored playing without regular meter, beat and formal structures, and in the mid-1950s, hard bop emerged, which introduced influences from rhythm and blues, gospel, and blues, especially in the saxophone and piano playing. Modal jazz developed in the late 1950s, using the mode, or musical scale, as the basis of musical structure and improvisation. Jazz-rock fusion appeared in the late 1960s and early 1970s, combining jazz improvisation with rock music's rhythms, electric instruments, and highly amplified stage sound. In the early 1980s, a commercial form of jazz fusion called smooth jazz became successful, garnering significant radio airplay. Other styles and genres abound in the 2000s, such as Latin and Afro-Cuban jazz.\n</p>",
	"links": ["mpb", "samba", "forro", "soul", "funk", "pagode", "afrobeat"]
}, {
	"name": "k-pop",
	"color": "#e6ff00",
	"x": 1025,
	"y": 1275,
	"z": -1275,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n\n\n<p class=\"mw-empty-elt\">\n</p>\n<p><b>K-pop</b> (abbreviation of <b>Korean pop</b>; Hangul: <span lang=\"ko-Hang\" title=\"Korean language text\">케이팝</span>) is a genre of music characterized by a wide variety of audiovisual elements. While the modern form of K-pop can be traced back to the early 90s, the term itself has been popularized since the 2000s, replacing the term <i>Gayo</i> (가요), which also refers to domestic pop music in South Korea. Although it generally indicates \"popular music\" within South Korea, the term is often used in a narrower sense to describe a modern form of South Korean pop that is influenced by styles and genres from around the world, such as experimental, jazz, gospel, hip hop, R&amp;B, reggae, electronic dance, folk, country, and classical on top of its traditional Korean music roots. The more modern form of the genre emerged with the formation of one of the earliest K-pop groups, Seo Taiji and Boys, in 1992. Their experimentation with different styles and genres of music and integration of foreign musical elements helped reshape and modernize South Korea's contemporary music scene.</p><p>Modern K-pop \"idol\" culture began with the boy band H.O.T. in 1996, as K-pop grew into a subculture that amassed enormous fandoms of teenagers and young adults. After a slump in early K-pop, from 2003 TVXQ and BoA started a new generation of K-pop idols that broke the music genre into the neighboring Japanese market and continue to popularize K-pop internationally today. With the advent of online social networking services and Korean TV shows, the current global spread of K-pop and Korean entertainment, known as the Korean Wave, is seen not only in East and Southeast Asia but also Latin America, India, North Africa, the Middle East and the Western world, gaining a widespread global audience.</p>\n\n\n",
	"links": ["j-pop", "j-idol"]
}, {
	"name": "kids",
	"color": "#d9ff00",
	"x": 895,
	"y": 1275,
	"z": -1275,
	"info": "Music made for children",
	"links": ["pop"]
}, {
	"name": "latin",
	"color": "#ff8830",
	"x": 1275,
	"y": 85,
	"z": -795,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n<p><b>Latin music</b> (Portuguese and Spanish: <i lang=\"es\">música latina</i>) is a genre used by the music industry as a catch-all term for music that comes from Spanish- and Portuguese-speaking areas of the world, namely Ibero America and Iberian Peninsula, as well as music sung in either language. In the United States, the music industry defines Latin music as any recording sung mostly in Spanish regardless of its genre or the artist's nationality. The Recording Industry Association of America (RIAA) and <i>Billboard</i> magazine use this definition of Latin music to track sales of Spanish-language records in the US. Spain, Brazil, Mexico and the United States are the largest Latin music markets in the world.</p>",
	"links": ["pop", "salsa", "reggaeton", "edm", "mpb", "rock", "samba"]
}, {
	"name": "latino",
	"color": "#ff7338",
	"x": 1275,
	"y": -125,
	"z": -715,
	"info": "<p>The <b>music of Latin America</b> refers to music originating from Latin America, namely the Romance-speaking countries and territories of the Americas and the Caribbean south of the United States. Latin American music also incorporates African music from slaves who were transported to the Americas by European settlers as well as music from the indigenous peoples of the Americas. Due to its highly syncretic nature, Latin American music encompasses a wide variety of styles, including influential genres such as bachata, bossa nova, merengue, rumba, salsa, samba, son, and tango. During the 20th century, many styles were influenced by the music of the United States giving rise to genres such as Latin pop, rock, jazz, hip hop, and reggaeton.\n</p><p>Geographically, it usually refers to the Spanish and Portuguese-speaking regions of Latin America, but sometimes includes Francophone countries and territories of the Caribbean and South America as well. It also encompasses Latin American styles that have originated in the United States such as salsa and Tejano. The origins of Latin American music can be traced back to the Spanish and Portuguese conquest of the Americas in the 16th century, when the European settlers brought their music from overseas. Latin American music is performed in Spanish, Portuguese, and to a lesser extent, French.</p>",
	"links": ["latin", "pop", "reggaeton", "salsa", "edm"]
}, {
	"name": "malay",
	"color": "#703d00",
	"x": -155,
	"y": -665,
	"z": -1275,
	"info": "<p class=\"mw-empty-elt\">\n\n</p>\n<p><b>Music of Malaysia</b> is the generic term for music that has been created in various genres in Malaysia. A great variety of genres in Malaysian music reflect the specific cultural groups within multiethnic Malaysian society: Malay, Chinese, Indian, Dayak, Kadazan-Dusun, Bajau, Orang Asli, Melanau, Kristang and others.\n</p><p>In general, music of Malaysia may be categorised as classical, folk, syncretic (or acculturated music), popular and contemporary art music. Classical and folk music emerged during the pre-colonial period and exists in the form of vocal, dance and theatrical music such as <i>Nobat</i>, <i>Mak Yong</i>, <i>Mak Inang</i>, <i>Dikir barat</i>, <i>Ulek mayang</i> and <i>Menora</i>. The syncretic music developed during the post-Portuguese period (16th century) and contains elements from both local music and foreign elements of Arabian, Persian, Indian, Chinese and Western musical and theatrical sources. Among genres of this music are <i>Zapin</i>, <i>Ghazal</i>, <i>Dondang Sayang</i>, <i>Mata-kantiga</i>, <i>Joget</i>,  <i>Jikey</i>, <i>Boria</i> and <i>Bangsawan</i>.</p><p>Both Malaysian popular music and contemporary art music are essentially Western-based music combined with some local elements. In 1950s, the musician P. Ramlee helped in creating a Malaysian music that combined folks songs with Western dance rhythms and western Asian music.</p>",
	"links": []
}, {
	"name": "mandopop",
	"color": "#5d341c",
	"x": -345,
	"y": -755,
	"z": -995,
	"info": "<p><b>Mandopop</b> refers to Mandarin popular music.  The English term was coined around 1980 soon after \"Cantopop\" became a popular term for describing popular songs in Cantonese; \"Mandopop\" was used to describe Mandarin-language popular songs of that time, some of which were versions of Cantopop songs sung by the same singers with different lyrics to suit the different rhyme and tonal patterns of Mandarin.   It is now used as a general term to describe popular songs performed in Mandarin.\n</p><p>Mandopop is categorized as a subgenre of commercial Chinese-language music within C-pop. Popular music sung in mandarin was the first variety of popular music in Chinese to establish itself as a viable industry. It originated in Shanghai, and later Hong Kong, Taipei and Beijing also emerged as important centers of the Mandopop music industry. Among the countries where Mandopop is most popular are mainland China, Macau, Hong Kong, Taiwan, Malaysia, Singapore, Vietnam and Japan.\n</p>",
	"links": ["cantopop"]
}, {
	"name": "metal",
	"color": "#171717",
	"x": -1045,
	"y": -1045,
	"z": -1045,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n<p><b>Heavy metal</b> (or simply <b>metal</b>) is a genre of rock music that developed in the late 1960s and early 1970s, largely in the United Kingdom. With roots in blues rock, psychedelic rock, and acid rock, the bands that created heavy metal developed a thick, massive sound, characterized by highly amplified distortion, extended guitar solos, emphatic beats, and overall loudness. The genre's lyrics and performance styles are sometimes associated with aggression and machismo.</p><p>In 1968, three of the genre's most famous pioneers, Led Zeppelin, Black Sabbath and Deep Purple were founded. Though they came to attract wide audiences, they were often derided by critics. During the mid-1970s, Judas Priest helped spur the genre's evolution by discarding much of its blues influence; Motörhead introduced a punk rock sensibility and an increasing emphasis on speed. Beginning in the late 1970s, bands in the new wave of British heavy metal such as Iron Maiden and Saxon followed in a similar vein. Before the end of the decade, heavy metal fans became known as \"metalheads\" or \"headbangers\".\n</p><p>During the 1980s, glam metal became popular with groups such as Mötley Crüe, Poison and Def Leppard. Underground scenes produced an array of more aggressive styles: thrash metal broke into the mainstream with bands such as Metallica, Slayer, Megadeth, and Anthrax, while other extreme subgenres of heavy metal such as death metal (with bands such as Death, Possessed, and Obituary) and black metal (with bands such as Mayhem, Bathory, and Immortal) remain subcultural phenomena. Since the mid-1990s popular styles have further expanded the definition of the genre. These include groove metal (with bands such as Pantera, Sepultura, and Lamb of God) and nu metal (with bands such as Korn, Slipknot, and Linkin Park), the latter of which often incorporates elements of grunge and hip hop.\n</p>",
	"links": ["rock", "metalcore"]
}, {
	"name": "metal-misc",
	"color": "#131313",
	"x": -1085,
	"y": -1085,
	"z": -1085,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n<p><b>Heavy metal</b> (or simply <b>metal</b>) is a genre of rock music that developed in the late 1960s and early 1970s, largely in the United Kingdom. With roots in blues rock, psychedelic rock, and acid rock, the bands that created heavy metal developed a thick, massive sound, characterized by highly amplified distortion, extended guitar solos, emphatic beats, and overall loudness. The genre's lyrics and performance styles are sometimes associated with aggression and machismo.</p><p>In 1968, three of the genre's most famous pioneers, Led Zeppelin, Black Sabbath and Deep Purple were founded. Though they came to attract wide audiences, they were often derided by critics. During the mid-1970s, Judas Priest helped spur the genre's evolution by discarding much of its blues influence; Motörhead introduced a punk rock sensibility and an increasing emphasis on speed. Beginning in the late 1970s, bands in the new wave of British heavy metal such as Iron Maiden and Saxon followed in a similar vein. Before the end of the decade, heavy metal fans became known as \"metalheads\" or \"headbangers\".\n</p><p>During the 1980s, glam metal became popular with groups such as Mötley Crüe, Poison and Def Leppard. Underground scenes produced an array of more aggressive styles: thrash metal broke into the mainstream with bands such as Metallica, Slayer, Megadeth, and Anthrax, while other extreme subgenres of heavy metal such as death metal (with bands such as Death, Possessed, and Obituary) and black metal (with bands such as Mayhem, Bathory, and Immortal) remain subcultural phenomena. Since the mid-1990s popular styles have further expanded the definition of the genre. These include groove metal (with bands such as Pantera, Sepultura, and Lamb of God) and nu metal (with bands such as Korn, Slipknot, and Linkin Park), the latter of which often incorporates elements of grunge and hip hop.\n</p>",
	"links": ["metal", "rock", "metalcore"]
}, {
	"name": "metalcore",
	"color": "#0f0f0f",
	"x": -1125,
	"y": -1125,
	"z": -1125,
	"info": "<p><span></span></p><p><b>Metalcore</b> is a fusion genre combining elements of extreme metal and hardcore punk. The word is a portmanteau of the two genres. Among other styles blending metal and hardcore, such as crust punk and grindcore, metalcore is noted for its use of breakdowns, which are slow, intense passages conducive to moshing. Pioneering metalcore bands—such as Integrity, Earth Crisis, Converge and All Out War  all of which had formed by 1991—are described as leaning more toward hardcore, with their style sometimes being called <b>metallic hardcore</b>, whereas later bands—such as Killswitch Engage, All That Remains, Trivium, As I Lay Dying, Bullet for My Valentine, and Parkway Drive—are described as leaning more towards metal. Pantera and Sepultura (who influenced Trivium, Atreyu, Bleeding Through and Unearth) have been particularly influential to the development of metalcore in the 2000s, which saw many bands in the genre achieve commercial success. \n</p>",
	"links": ["rock", "emo", "metal"]
}, {
	"name": "minimal-techno",
	"color": "#7070ff",
	"x": -155,
	"y": -155,
	"z": 1275,
	"info": "<p><b>Minimal techno</b> is a minimalist subgenre of techno music. It is characterized by a stripped-down aesthetic that exploits the use of repetition and understated development. Minimal techno is thought to have been originally developed in the early 1990s by Detroit-based producers Robert Hood and Daniel Bell. By the early 2000s the term 'minimal' generally described a style of techno that was popularised in Germany by labels such as Kompakt, Perlon, and Richie Hawtin's M-nus, among others.\n</p>",
	"links": ["techno", "house", "electronic", "trance", "ambient", "edm", "electro"]
}, {
	"name": "movies",
	"color": "#ffd117",
	"x": 1275,
	"y": 815,
	"z": -1045,
	"info": "<p class=\"mw-empty-elt\">\n</p><p>A <b>film score</b> (also sometimes called <b>background score</b>, <b>background music</b>, <b>film soundtrack</b>, <b>film music</b>, or <b>incidental music</b>) is original music written specifically to accompany a film. The score forms part of the film's soundtrack, which also usually includes pre-existing music, dialogue and sound effects, and comprises a number of orchestral, instrumental, or choral pieces called cues, which are timed to begin and end at specific points during the film in order to enhance the dramatic narrative and the emotional impact of the scene in question. Scores are written by one or more composers, under the guidance of, or in collaboration with, the film's director or producer and are then usually performed by an ensemble of musicians – most often comprising an orchestra or band, instrumental soloists, and choir or vocalists – and  recorded by a sound engineer.\n</p><p>Film scores encompass an enormous variety of styles of music, depending on the nature of the films they accompany. The majority of scores are orchestral works rooted in Western classical music, but many scores are also influenced by jazz, rock, pop, blues, new-age and ambient music, and a wide range of ethnic and world music styles. Since the 1950s, a growing number of scores have also included electronic elements as part of the score, and many scores written today feature a hybrid of orchestral and electronic instruments.</p><p>Since the invention of digital technology and audio sampling, many modern films have been able to rely on digital samples to imitate the sound of live instruments, and many scores are created and performed wholly by the composers themselves, by using music composition software.\n</p><p>Songs are usually not considered part of the film's score, although songs do also form part of the film's soundtrack. Although some songs, especially in musicals, are based on thematic ideas from the score (or vice versa), scores usually do not have lyrics, except for when sung by choirs or soloists as part of a cue. Similarly, pop songs which are \"needle dropped\" into a specific scene in film for added emphasis are not considered part of the score, although occasionally the score's composer will write an original pop song based on their themes, such as James Horner's \"My Heart Will Go On\" from <i>Titanic</i>, written for Celine Dion.\n</p>",
	"links": ["classical", "disney", "country", "pop", "electro", "electronic", "rock", "rockabilly", "disco", "funk", "soul", "edm", "mpb", "samba", "opera"]
}, {
	"name": "mpb",
	"color": "#a3ff3d",
	"x": 355,
	"y": 1275,
	"z": -665,
	"info": "<p><b>Música popular brasileira</b> (<small>Portuguese pronunciation: </small><span title=\"Representation in the International Phonetic Alphabet (IPA)\">[ˈmuzikɐ popuˈlaʁ bɾaziˈlejɾɐ]</span>, <i>Popular Brazilian Music</i>) or <b>MPB</b> is a trend in post-bossa nova urban popular music in Brazil that revisits typical Brazilian styles such as samba, samba-canção and baião and other Brazilian regional music, combining them with foreign influences, such as jazz and rock.\n</p><p>This movement has produced and today is represented by many renowned Brazilian artists, such as Jorge Ben Jor, Novos Baianos, Chico Buarque and Dominguinhos, whose individual styles generated their own trends within the genre. The term often also is used to describe any kind of music with Brazilian origins and \"voice and guitar style\" that arose in the late 1960s.\n</p><p>Variations within MPB were the short-lived but influential artistic movement known as tropicália, and the music of samba rock.</p>",
	"links": ["forro", "samba", "pagode", "sertanejo"]
}, {
	"name": "new-age",
	"color": "#c2d14d",
	"x": 665,
	"y": 815,
	"z": -505,
	"info": "<p><b>New-age music</b> is a genre of music intended to create artistic inspiration, relaxation, and optimism. It is used by listeners for yoga, massage, meditation, reading as a method of stress management to bring about a state of ecstasy rather than trance, or to create a peaceful atmosphere in their home or other environments, and is associated with environmentalism and New Age spirituality.</p><p>New-age music includes both acoustic forms, featuring instruments such as flutes, piano, acoustic guitar and a wide variety of non-Western acoustic instruments, and electronic forms, frequently relying on sustained synth pads or long sequencer-based runs. Vocal arrangements were initially rare in the genre, but as it has evolved vocals have become more common, especially those featuring Native American-, Sanskrit-, or Tibetan-influenced chants, or lyrics based on mythology such as Celtic legends.</p><p>There is no exact definition of new-age music. An article in <i>Billboard</i> magazine in 1987 commented that \"New Age music may be the most startling successful non-defined music ever to hit the public consciousness\".  Many consider it to be an umbrella term for marketing rather than a musical category, and to be part of a complex cultural trend.</p><p>New-age music was influenced by a wide range of artists from a variety of genres. Tony Scott's <i>Music for Zen Meditation</i> (1964) is considered to be the first new-age recording. Paul Horn (beginning with 1968's <i>Inside</i>) was one of the important predecessors. Irv Teibel's <i>Environments</i> series (1969–79) featured natural soundscapes, tintinnabulation, and \"Om\" chants and were some of the first publicly available psychoacoustic recordings. Steven Halpern's 1975 <i>Spectrum Suite</i> was a key work that began the new-age music movement.</p>\n\n\n",
	"links": ["pop", "ambient"]
}, {
	"name": "new-release",
	"color": "#fff106",
	"x": 1275,
	"y": 1135,
	"z": -1215,
	"info": "Music that has just been released.",
	"links": ["pop", "edm", "house", "electro", "rock", "emo", "country"]
}, {
	"name": "opera",
	"color": "#d9822b",
	"x": 895,
	"y": 25,
	"z": -845,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n\n<p><b>Opera</b> (<small>Italian: </small><span title=\"Representation in the International Phonetic Alphabet (IPA)\">[ˈɔːpera]</span>; English plural: <i>operas</i>; Italian plural: <i>opere</i> <small></small><span title=\"Representation in the International Phonetic Alphabet (IPA)\">[ˈɔːpere]</span>) is a form of theatre in which music has a leading role and the parts are taken by singers.  Such a \"work\" (the literal translation of \"opera\") is typically a collaboration between a composer and a librettist and incorporates a number of the performing arts, such as acting, scenery, costume, and sometimes dance or ballet. The performance is typically given in an opera house, accompanied by an orchestra or smaller musical ensemble, which since the early 19th century has been led by a conductor.\n</p><p>Opera is a key part of the Western classical music tradition. Originally understood as an entirely sung piece, in contrast to a play with songs, opera has come to include numerous genres, including some that include spoken dialogue such as musical theater, <i>Singspiel</i> and <i>Opéra comique</i>. In traditional number opera, singers employ two styles of singing: recitative, a speech-inflected style and self-contained arias. The 19th century saw the rise of the continuous music drama.\n</p><p>Opera originated in Italy at the end of the 16th century (with Jacopo Peri's mostly lost <i>Dafne</i>, produced in Florence in 1598) and soon spread through the rest of Europe: Heinrich Schütz in Germany, Jean-Baptiste Lully in France, and Henry Purcell in England all helped to establish their national traditions in the 17th century. In the 18th century, Italian opera continued to dominate most of Europe (except France), attracting foreign composers such as George Frideric Handel. Opera seria was the most prestigious form of Italian opera, until Christoph Willibald Gluck reacted against its artificiality with his \"reform\" operas in the 1760s. The most renowned figure of late 18th-century opera is Wolfgang Amadeus Mozart, who began with opera seria but is most famous for his Italian comic operas, especially <i>The Marriage of Figaro</i> (<i>Le nozze di Figaro</i>), <i>Don Giovanni</i>, and <i>Così fan tutte</i>, as well as <i>Die Entführung aus dem Serail</i> (<i>The Abduction from the Seraglio</i>), and <i>The Magic Flute</i> (<i>Die Zauberflöte</i>), landmarks in the German tradition.\n</p><p>The first third of the 19th century saw the high point of the bel canto style, with Gioachino Rossini, Gaetano Donizetti and Vincenzo Bellini all creating works that are still performed. It also saw the advent of Grand Opera typified by the works of Auber and Meyerbeer. The mid-to-late 19th century was a golden age of opera, led and dominated by Giuseppe Verdi in Italy and Richard Wagner in Germany. The popularity of opera continued through the verismo era in Italy and contemporary French opera through to Giacomo Puccini and Richard Strauss in the early 20th century. During the 19th century, parallel operatic traditions emerged in central and eastern Europe, particularly in Russia and Bohemia. The 20th century saw many experiments with modern styles, such as atonality and serialism (Arnold Schoenberg and Alban Berg), Neoclassicism (Igor Stravinsky), and Minimalism (Philip Glass and John Adams). With the rise of recording technology, singers such as Enrico Caruso and Maria Callas became known to much wider audiences that went beyond the circle of opera fans. Since the invention of radio and television, operas were also performed on (and written for) these mediums. Beginning in 2006, a number of major opera houses began to present live high-definition video transmissions of their performances in cinemas all over the world. Since 2009, complete performances can be downloaded and are live streamed.\n</p>",
	"links": ["rock", "classical", "folk", "singer-songwriter", "sleep"]
}, {
	"name": "pagode",
	"color": "#57a800",
	"x": -405,
	"y": 405,
	"z": -1275,
	"info": "<p><b>Pagode</b> (<small>Portuguese pronunciation: </small><span title=\"Representation in the International Phonetic Alphabet (IPA)\">[paˈɡɔdʒi]</span>) is a Brazilian style of music that originated in Rio de Janeiro, Brazil, as a subgenre of Samba. Pagode originally meant a celebration with food, music, dance, and party. In 1978, singer Beth Carvalho was introduced to this music, liked it from the beginning, and recorded tracks by Zeca Pagodinho and others. Over time, pagode has been used by many commercial groups, which have included a version of the music filled with clichés, and there is now a sentiment that the term is a pejorative for \"very commercial pop music\" (see Pagode Romântico).</p><p>Original pagode developed at the beginning of the 1980s, with the advent of the band Fundo de Quintal and the introduction of new instruments in the classical samba formation. Pagode lyricism also represented a kind of evolution toward the tradition of malicious and ironic samba lyrics, with a much heavier use of slang and underground terms.\n</p><p>The 4-string banjo, whose introduction is mostly credited to Almir Guineto, has a different and louder sound than the cavaco; that loudness was an advantage in acoustic environments (samba circle), where there are many percussion instruments and people singing along. The 4-string banjo is one of the most characteristic instruments of the pagode sound.\n</p><p>The tan-tan, whose introduction is credited to sereno, is a more dynamic type of surdo, used to keep the main beat of the samba, the \"heart of the samba\", and played with the hands.\n</p><p>The hand-repique, whose introduction is credited to Ubirany, is a percussive instrument used specially for rhythmic turnarounds.\n</p>",
	"links": ["mpb", "samba", "sertanejo", "forro"]
}, {
	"name": "party",
	"color": "#828282",
	"x": 25,
	"y": 25,
	"z": 25,
	"info": "Music created to play on parties.",
	"links": ["pop", "edm", "latin", "rock", "house", "emo", "funk", "soul", "trance"]
}, {
	"name": "philippines-opm",
	"color": "#997d4a",
	"x": 255,
	"y": -25,
	"z": -535,
	"info": "<p><b>Music of the Philippines</b> (Filipino: <i lang=\"fil\">Musika ng Pilipinas</i>; Spanish: <i lang=\"es\">Música de Filipinas</i>) include musical performance arts in the Philippines or by Filipinos composed in various genres and styles. The compositions are often a mixture of different Asian, Spanish, Latin American, American, and indigenous influences.\n</p>",
	"links": []
}, {
	"name": "piano",
	"color": "#ffbd00",
	"x": 1275,
	"y": 615,
	"z": -1275,
	"info": "Music in which the piano is the dominant instrument.",
	"links": ["ambient", "rock", "singer-songwriter", "pop", "classical", "anime", "sleep", "electronic"]
}, {
	"name": "pop",
	"color": "#FFFF00",
	"x": 1275,
	"y": 1275,
	"z": -1275,
	"info": "<p><b>Pop music</b> is a genre of popular music that originated in its modern form in the United States and United Kingdom during the mid-1950s. The terms \"popular music\" and \"pop music\" are often used interchangeably, although the former describes all music that is popular and includes many diverse styles. \"Pop\" and \"rock\" were roughly synonymous terms until the late 1960s, when they became increasingly differentiated from each other.\n</p><p>Although much of the music that appears on record charts is seen as pop music, the genre is distinguished from chart music. Pop music is eclectic, and often borrows elements from other styles such as urban, dance, rock, Latin, and country; nonetheless, there are core elements that define pop music. Identifying factors include generally short to medium-length songs written in a basic format (often the verse-chorus structure), as well as common use of repeated choruses, melodic tunes, and hooks.\n</p>",
	"links": ["edm", "house", "country", "dancehall", "rock", "trance", "funk", "singer-songwriter", "latin", "reggaeton", "emo"]
}, {
	"name": "pop-film",
	"color": "#ffc200",
	"x": 1275,
	"y": 665,
	"z": -1275,
	"info": "Pop-music which is used in films",
	"links": ["rock", "pop", "breakbeat", "electronic", "disco", "folk", "rockabilly", "soul", "singer-songwriter", "funk", "punk"]
}, {
	"name": "post-dubstep",
	"color": "#1d1dff",
	"x": -985,
	"y": -985,
	"z": 1275,
	"info": "<p class=\"mw-empty-elt\">\n\n\n</p>\n<p><b>Dubstep</b> is a genre of electronic dance music that originated in South London in the late 1990s. It is generally characterized by sparse, syncopated rhythmic patterns with bass lines that contain prominent sub-bass frequencies. The style emerged as an offshoot of UK garage, drawing on a lineage of related styles such as 2-step and dub reggae, as well as jungle,  broken beat, and grime. In the United Kingdom the origins of the genre can be traced back to the growth of the Jamaican sound system party scene in the early 1980s.</p><p>The earliest dubstep releases date back to 1998, and were usually featured as B-sides of 2-step garage single releases. These tracks were darker, more experimental remixes with less emphasis on vocals, and attempted to incorporate elements of breakbeat and drum and bass into 2-step. In 2001, this and other strains of dark garage music began to be showcased and promoted at London's night club Plastic People, at the \"Forward\" night (sometimes stylised as FWD&gt;&gt;), which went on to be considerably influential to the development of dubstep. The term \"dubstep\" in reference to a genre of music began to be used by around 2002 by labels such as Big Apple, Ammunition, and Tempa, by which time stylistic trends used in creating these remixes started to become more noticeable and distinct from 2-step and grime.</p><p>A very early supporter of the sound was BBC Radio 1 DJ John Peel, who started playing it from 2003 onwards. In 2004, the last year of his show, his listeners voted Distance, Digital Mystikz, and Plastician in their top 50 for the year. Dubstep started to enter mainstream British popular culture when it spread beyond small local scenes in late 2005 and early 2006; many websites devoted to the genre appeared on the Internet and aided the growth of the scene, such as dubstepforum, the download site Barefiles and blogs such as gutterbreakz. Simultaneously, the genre was receiving extensive coverage in music magazines such as <i>The Wire</i> and online publications such as Pitchfork, with a regular feature entitled <i>The Month In: Grime/Dubstep</i>. Interest in dubstep grew significantly after BBC Radio 1 DJ Mary Anne Hobbs started championing the genre, beginning with a show devoted to it (entitled \"Dubstep Warz\") in January 2006.</p><p>Towards the end of the 2000s and into the early 2010s, the genre started to become more commercially successful in the UK, with more singles and remixes entering the music charts. Music journalists and critics also noticed a dubstep influence in several pop artists' work. Around this time, producers also began to fuse elements of the original dubstep sound with other influences, creating fusion genres including future garage, the slower and more experimental post-dubstep, and the harsher electro house and heavy metal influenced brostep, the latter of which greatly contributed to dubstep's popularity in the United States.</p>",
	"links": ["electronic", "dubstep", "funk", "soul", "edm", "pop"]
}, {
	"name": "power-pop",
	"color": "#949400",
	"x": 205,
	"y": 205,
	"z": -1275,
	"info": "<p><b>Power pop</b> (also typeset as <b>powerpop</b>) is a form of pop rock based on the early music of bands such as the Who, the Beatles, the Beach Boys, and the Byrds. It originated in the late 1960s as young music fans began to rebel against the emerging pretensions of rock music, and developed mainly among American musicians who came of age during the British Invasion. The genre typically incorporates melodic hooks, vocal harmonies, an energetic performance, and \"happy\"-sounding music supported by a sense of yearning, longing, or despair.\n</p><p>The term \"power pop\" was coined by the Who's Pete Townshend to describe their 1967 single \"Pictures of Lily\". However, the term became more widely identified with subsequent artists from the 1970s who sought to revive Beatles-style pop. The sound of the genre became more established thanks to early 1970s hits by Badfinger, the Raspberries, and Todd Rundgren. Following the rise of new wave and punk, power pop reached its commercial peak with Cheap Trick, the Knack, the Romantics, Nick Lowe, Dave Edmunds, and Dwight Twilley. At the same time, music critics who wrote about the phenomenon popularized the term's usage. It was sometimes characterized as a more commercial counterpart of punk.\n</p><p>After a popular and critical backlash to the genre's biggest-ever hit, \"My Sharona\" (The Knack, 1979), record companies generally stopped signing power pop groups, and most of its bands broke up in the early 1980s. Over the next two decades, power pop continued with modest commercial success. The 1990s saw a new wave of bands that were drawn to 1960s artists because of the 1980s music they influenced. Although not as successful as their predecessors, Jellyfish, the Posies, Redd Kross, Teenage Fanclub, and Material Issue were critical and cult favorites.\n</p>",
	"links": ["grunge", "folk", "singer-songwriter", "rock", "rockabilly", "punk"]
}, {
	"name": "progressive-house",
	"color": "#4747b8",
	"x": -565,
	"y": -565,
	"z": 565,
	"info": "<p><b>Progressive house</b> is a style (subgenre) of house music. The progressive house style emerged in the early 1990s. It initially developed in the United Kingdom as a natural progression of American and European house music of the late 1980s.</p>",
	"links": ["edm", "house", "pop", "hardstyle", "trance", "electronic", "rock"]
}, {
	"name": "psych-rock",
	"color": "#00008c",
	"x": -1275,
	"y": -1275,
	"z": 125,
	"info": "<p class=\"mw-empty-elt\">\n\n</p>\n<p><b>Psychedelic rock</b> is a diverse style of rock music inspired, influenced, or representative of psychedelic culture, which is centred around perception-altering hallucinogenic drugs. The music is intended to replicate and enhance the mind-altering experiences of psychedelic drugs, most notably LSD. Many psychedelic groups differ in style, and the label is often applied spuriously.</p><p>Originating in the mid-1960s among British and American musicians, the sounds of psychedelic rock invokes three core effects of LSD: depersonalization, dechronicization, and dynamization; all of which detach the user from reality. Musically, the effects may be represented via novelty studio tricks, electronic or non-Western instrumentation, disjunctive song structures, and extended instrumental segments. Some of the earlier 1960s psychedelic rock musicians were based in folk, jazz, and the blues, while others showcased an explicit Indian classical influence called \"raga rock\".  In the 1960s, there existed two main variants of the genre: the whimsical British pop-psychedelia and the harder American West Coast acid rock. While \"acid rock\" is sometimes deployed interchangeably with the term \"psychedelic rock\", it also refers more specifically to the heavier and more extreme ends of the genre.\n</p><p>The peak years of psychedelic rock were between 1966 and 1969, with milestone events including the 1967 Summer of Love and the 1969 Woodstock Rock Festival, becoming an international musical movement associated with a widespread counterculture before beginning a decline as changing attitudes, the loss of some key individuals and a back-to-basics movement, led surviving performers to move into new musical areas. The genre bridged the transition from early blues and folk-based rock to progressive rock and hard rock, and as a result contributed to the development of sub-genres such as heavy metal. Since the late 1970s it has been revived in various forms of neo-psychedelia.\n</p>\n\n",
	"links": ["rock", "electronic", "folk"]
}, {
	"name": "punk",
	"color": "#333300",
	"x": -765,
	"y": -765,
	"z": -1275,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n<p><b>Punk rock</b> (or \"<b>punk</b>\") is a rock music genre that developed in the mid-1970s in the United States, United Kingdom, and Australia. Rooted in 1960s garage rock and other forms of what is now known as \"proto-punk\" music, punk rock bands rejected perceived excesses of mainstream 1970s rock. Punk bands typically produced short or fast-paced songs, with hard-edged melodies and singing styles, stripped-down instrumentation, and often political, anti-establishment lyrics. Punk embraces a DIY ethic; many bands self-produce recordings and distribute them through independent record labels and other informal channels.\n</p><p>The term \"punk rock\" was first used by certain American rock critics in the early 1970s to describe 1960s garage bands and subsequent acts then perceived as stylistic inheritors.  Between 1974 and 1976 the movement now bearing the name \"punk rock\" emerged.  It produced a new generation of bands such as the Ramones, Johnny Thunders and the Heartbreakers, Richard Hell and the Voidoids in New York City, the Sex Pistols, the Clash, the Damned and Buzzcocks in the UK, and the Saints in Brisbane—by late 1976 these acts were generally recognized as forming its vanguard.  As 1977 approached, punk rock became a major and highly controversial cultural phenomenon in the United Kingdom.  It spawned a punk subculture expressing youthful rebellion characterized by distinctive styles of clothing and adornment (ranging from deliberately offensive T-shirts, leather jackets, studded or spiked bands and jewelry, as well as bondage and S&amp;M clothes) and a variety of anti-authoritarian ideologies that have since been associated with the form.\n</p><p>In 1977 the influence of punk rock music and subculture became more pervasive, spreading throughout various countries worldwide.  It generally took root in local scenes that tended to reject affiliation with the mainstream.  In the late 1970s punk experienced its second wave in which acts that were not active during its formative years adopted the style.  By the early 1980s, faster and more aggressive subgenres such as hardcore punk (e.g. Minor Threat), street punk (e.g. the Exploited) and anarcho-punk (e.g. Subhumans) became the predominant modes of punk rock.  Musicians identifying with or inspired by punk often later pursued other musical directions, resulting in a broad range of spinoffs, giving rise to genres such as post-punk, new wave and later indie pop, alternative rock, and noise rock.  By the 1990s punk rock re-emerged in the mainstream, as punk rock and pop punk bands such as Green Day, Rancid, The Offspring, and Blink-182 brought the genre widespread popularity.\n</p>",
	"links": ["emo", "hardcore", "ska", "metalcore", "rock", "grunge"]
}, {
	"name": "punk-rock",
	"color": "#191900",
	"x": -1025,
	"y": -1025,
	"z": -1275,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n<p><b>Punk rock</b> (or \"<b>punk</b>\") is a rock music genre that developed in the mid-1970s in the United States, United Kingdom, and Australia. Rooted in 1960s garage rock and other forms of what is now known as \"proto-punk\" music, punk rock bands rejected perceived excesses of mainstream 1970s rock. Punk bands typically produced short or fast-paced songs, with hard-edged melodies and singing styles, stripped-down instrumentation, and often political, anti-establishment lyrics. Punk embraces a DIY ethic; many bands self-produce recordings and distribute them through independent record labels and other informal channels.\n</p><p>The term \"punk rock\" was first used by certain American rock critics in the early 1970s to describe 1960s garage bands and subsequent acts then perceived as stylistic inheritors.  Between 1974 and 1976 the movement now bearing the name \"punk rock\" emerged.  It produced a new generation of bands such as the Ramones, Johnny Thunders and the Heartbreakers, Richard Hell and the Voidoids in New York City, the Sex Pistols, the Clash, the Damned and Buzzcocks in the UK, and the Saints in Brisbane—by late 1976 these acts were generally recognized as forming its vanguard.  As 1977 approached, punk rock became a major and highly controversial cultural phenomenon in the United Kingdom.  It spawned a punk subculture expressing youthful rebellion characterized by distinctive styles of clothing and adornment (ranging from deliberately offensive T-shirts, leather jackets, studded or spiked bands and jewelry, as well as bondage and S&amp;M clothes) and a variety of anti-authoritarian ideologies that have since been associated with the form.\n</p><p>In 1977 the influence of punk rock music and subculture became more pervasive, spreading throughout various countries worldwide.  It generally took root in local scenes that tended to reject affiliation with the mainstream.  In the late 1970s punk experienced its second wave in which acts that were not active during its formative years adopted the style.  By the early 1980s, faster and more aggressive subgenres such as hardcore punk (e.g. Minor Threat), street punk (e.g. the Exploited) and anarcho-punk (e.g. Subhumans) became the predominant modes of punk rock.  Musicians identifying with or inspired by punk often later pursued other musical directions, resulting in a broad range of spinoffs, giving rise to genres such as post-punk, new wave and later indie pop, alternative rock, and noise rock.  By the 1990s punk rock re-emerged in the mainstream, as punk rock and pop punk bands such as Green Day, Rancid, The Offspring, and Blink-182 brought the genre widespread popularity.\n</p>",
	"links": ["punk", "emo", "grunge", "rock", "ska", "pop", "metal"]
}, {
	"name": "r-n-b",
	"color": "#FF0000",
	"x": 1275,
	"y": -1275,
	"z": -1275,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n<p><b>Rhythm and blues</b>, commonly abbreviated as <b>R&amp;B</b>, is a genre of popular music that originated in African American communities  in the 1940s. The term was originally used by record companies to describe recordings marketed predominantly to urban African Americans, at a time when \"urbane, rocking, jazz based music with a heavy, insistent beat\" was becoming more popular.\nIn the commercial rhythm and blues music typical of the 1950s through the 1970s, the bands usually consisted of piano, one or two guitars, bass, drums, one or more saxophones, and sometimes background vocalists. R&amp;B lyrical themes often encapsulate the African-American experience of pain and the quest for freedom and joy, as well as triumphs and failures in terms of relationships, economics, and aspirations.\n</p><p>The term \"rhythm and blues\" has undergone a number of shifts in meaning. In the early 1950s, it was frequently applied to blues records. Starting in the mid-1950s, after this style of music contributed to the development of rock and roll, the term \"R&amp;B\" became used to refer to music styles that developed from and incorporated electric blues, as well as gospel and soul music. In the 1960s, several British rock bands such as the Rolling Stones, the Who and the Animals were referred to and promoted as being R&amp;B bands; posters for the Who's residency at the Marquee Club in 1964 contained the slogan, \"Maximum R&amp;B\". Their mix of rock and roll and R&amp;B is now known as \"British rhythm and blues\". By the 1970s, the term \"rhythm and blues\" changed again and was used as a blanket term for soul and funk. In the 1980s, a newer style of R&amp;B developed, becoming known as \"contemporary R&amp;B\". It combines elements of rhythm and blues, pop, soul, funk, hip hop, and electronic music. Popular R&amp;B vocalists at the end of the 20th century included Prince, R. Kelly, Stevie Wonder, Chaka Khan, Whitney Houston, and Mariah Carey.</p>",
	"links": ["pop", "funk", "soul", "house", "disco", "gospel"]
}, {
	"name": "rainy-day",
	"color": "#b2b200",
	"x": 505,
	"y": 505,
	"z": -1275,
	"info": "Music that is especially nice to listen on a rainy day.",
	"links": ["pop", "singer-songwriter", "rock", "sleep", "folk", "emo", "latin", "disco", "funk", "soul"]
}, {
	"name": "reggae",
	"color": "#ff0066",
	"x": 1275,
	"y": -1275,
	"z": -255,
	"info": "<p><b>Reggae</b> (<span></span>) is a music genre that originated in Jamaica in the late 1960s. The term also denotes the modern popular music of Jamaica and its diaspora. A 1968 single by Toots and the Maytals, \"Do the Reggay\" was the first popular song to use the word \"reggae,\" effectively naming the genre and introducing it to a global audience. While sometimes used in a broad sense to refer to most types of popular Jamaican dance music, the term <i>reggae</i> more properly denotes a particular music style that was strongly influenced by traditional mento as well as American jazz and rhythm and blues, especially the New Orleans R&amp;B practiced by Fats Domino and Allen Toussaint, and evolved out of the earlier genres ska and rocksteady. Reggae usually relates news, social gossip, and political comment. Reggae spread into a commercialized jazz field, being known first as ‘Rudie Blues’, then ‘Ska’, later ‘Blue Beat’, and ‘Rock Steady’. It is instantly recognizable from the counterpoint between the bass and drum downbeat, and the offbeat rhythm section. The immediate origins of reggae were in ska and rocksteady; from the latter, reggae took over the use of the bass as a percussion instrument.</p><p>Reggae is deeply linked to the Rastafari, an Afrocentric religion which developed in Jamaica in the 1930's,  aiming at promoting Pan Africanism. Soon after the Rastafarian movement appeared, the international popularity of reggae music became associated with and increased the visibility of Rastafarianism spreading the Rastafari gospel throughout the world.  Reggae music is an important means of transporting vital messages of Rastafarianism. The musician becomes the messenger, and as Rastafarians see it,\"the soldier and the musician are tools for change.\"</p><p>Stylistically, reggae incorporates some of the musical elements  of rhythm and blues, jazz, mento (a celebratory, rural folk form that served its largely rural audience as dance music and an alternative to the hymns and adapted chanteys of local church singing), calypso, and also draws influence from traditional African folk rhythms. One of the most easily recognizable elements is offbeat rhythms; staccato chords played by a guitar or piano (or both) on the offbeats of the measure. The tempo of reggae is usually slower paced than ska but faster than rocksteady. The concept of call and response can be found throughout reggae music.The genre of reggae music is led by the drum and bass. Some key players in this sound are Jackie Jackson from Toots and the Maytals, Carlton Barrett from Bob Marley and the Wailers, Lloyd Brevett from The Skatalites, Paul Douglas from Toots and the Maytals, Lloyd Knibb from The Skatalites, Winston Grennan, Sly Dunbar, and Anthony \"Benbow\" Creary from The Upsetters. The bass guitar often plays the dominant role in reggae. The bass sound in reggae is thick and heavy, and equalized so the upper frequencies are removed and the lower frequencies emphasized. The guitar in reggae usually plays on the off beat of the rhythm.  It is common for reggae to be sung in Jamaican Patois, Jamaican English, and Iyaric dialects. Reggae is noted for its tradition of social criticism and religion in its lyrics, although many reggae songs discuss lighter, more personal subjects, such as love and socializing.\n</p><p>Reggae has spread to many countries across the world, often incorporating local instruments and fusing with other genres. Reggae en Español spread from the Spanish speaking Central American country of Panama to the mainland South American countries of Venezuela and Guyana then to the rest of South America. Caribbean music in the United Kingdom, including reggae, has been popular since the late 1960s, and has evolved into several subgenres and fusions. Many reggae artists began their careers in the UK, and there have been a number of European artists and bands drawing their inspiration directly from Jamaica and the Caribbean community in Europe. Reggae in Africa was boosted by the visit of Bob Marley to Zimbabwe in 1980. In Jamaica, authentic reggae is one of the biggest sources of income.</p>\n\n\n",
	"links": ["dancehall", "dub", "ska"]
}, {
	"name": "reggaeton",
	"color": "#ff8033",
	"x": 1275,
	"y": 5,
	"z": -765,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n<p><b>Reggaeton</b> (also known as <b>reggaetón</b> and <b>reguetón</b>) is a music style which originated in Puerto Rico during the late 1990s. It is influenced by hip hop and Latin American and Caribbean music. Vocals include rapping and singing, typically in Spanish.\n</p><p>Reggaeton is regarded as one of the most popular music genres in the Spanish-speaking Caribbean, in countries including Puerto Rico, Panama, Dominican Republic, Cuba, Colombia and Venezuela. Over the past decade, the genre has seen increased popularity across Latin America, as well as acceptance within mainstream Western music.</p>",
	"links": ["latin", "pop", "dancehall"]
}, {
	"name": "road-trip",
	"color": "#565669",
	"x": -415,
	"y": -415,
	"z": -225,
	"info": "Music that is nice to listen to on a road trip.",
	"links": ["edm", "pop", "rock", "folk", "country", "emo", "singer-songwriter", "k-pop", "house", "metal", "funk", "soul", "latin", "electro", "electronic", "disco", "bluegrass"]
}, {
	"name": "rock",
	"color": "#000000",
	"x": -1275,
	"y": -1275,
	"z": -1275,
	"info": "Rock music is a broad genre of popular music that originated as \"rock and roll\" in the United States in the early 1950s, and developed into a range of different styles in the 1960s and later, particularly in the United Kingdom and in the United States. It has its roots in 1940s and 1950s rock and roll, a style which drew heavily on the genres of blues, rhythm and blues, and from country music. Rock music also drew strongly on a number of other genres such as electric blues and folk, and incorporated influences from jazz, classical and other musical styles. Musically, rock has centered on the electric guitar, usually as part of a rock group with electric bass, drums, and one or more singers. Typically, rock is song-based music usually with a 4/4 time signature using a verse–chorus form, but the genre has become extremely diverse. Like pop music, lyrics often stress romantic love but also address a wide variety of other themes that are frequently social or political.",
	"links": ["metal", "emo", "metalcore", "grunge", "punk", "edm", "pop", "singer-songwriter"]
}, {
	"name": "rock-n-roll",
	"color": "#666666",
	"x": -255,
	"y": -255,
	"z": -255,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n<p><b>Rock and roll</b> (often written as <b>rock &amp; roll</b> or <b>rock 'n' roll</b>) is a genre of popular music that originated and evolved in the United States during the late 1940s and early 1950s from musical styles such as gospel, jump blues, jazz, boogie woogie, and rhythm and blues, along with country music. While elements of what was to become rock and roll can be heard in blues records from the 1920s and in country records of the 1930s, the genre did not acquire its name until 1954.</p><p>According to Greg Kot, \"rock and roll\" refers to a style of popular music originating in the U.S. in the 1950s prior to its development by the mid-1960s into \"the more encompassing international style known as rock music, though the latter also continued to be known as rock and roll.\" For the purpose of differentiation, this article deals with the first definition.\n</p><p>In the earliest rock and roll styles, either the piano or saxophone was typically the lead instrument, but these instruments were generally replaced or supplemented by guitar in the middle to late 1950s. The beat is essentially a dance rhythm with an accentuated backbeat, which is almost always provided by a snare drum. Classic rock and roll is usually played with one or two electric guitars (one lead, one rhythm), a double bass or string bass or (after the mid-1950s) an electric bass guitar, and a drum kit.</p><p>Beyond simply a musical style, rock and roll, as seen in movies, in fan magazines, and on television, influenced lifestyles, fashion, attitudes, and language. In addition, rock and roll may have contributed to the civil rights movement because both African-American and white American teenagers enjoyed the music. It went on to spawn various genres, often without the initially characteristic backbeat, that are now more commonly called simply \"rock music\" or \"rock\".\n</p>",
	"links": ["rock", "singer-songwriter", "rockabilly", "soul", "punk", "metal", "grunge", "blues"]
}, {
	"name": "rockabilly",
	"color": "#4c0f2e",
	"x": -515,
	"y": -1125,
	"z": -815,
	"info": "<p><b>Rockabilly</b> is one of the earliest styles of rock and roll music, dating back to the early 1950s in the United States, especially the South. As a genre it blends the sound of Western musical styles such as country with that of rhythm and blues, leading to what is considered \"classic\" rock and roll. Some have also described it as a blend of bluegrass with rock and roll. The term \"rockabilly\" itself is a portmanteau of \"rock\" (from \"rock 'n' roll\") and \"hillbilly\", the latter a reference to the country music (often called \"hillbilly music\" in the 1940s and 1950s) that contributed strongly to the style. Other important influences on rockabilly include western swing, Boogie-woogie, jump blues, and electric blues.</p><p>Defining features of the rockabilly sound included strong rhythms, vocal twangs, and common use of the tape echo; but progressive addition of different instruments and vocal harmonies led to its \"dilution\". Initially popularized by artists such as Wanda Jackson, Johnny Cash, Bill Haley, Buddy Holly, Elvis Presley, Carl Perkins, Bob Luman, and Jerry Lee Lewis, the influence and success of the style waned in the late 1950s; nonetheless, during the late 1970s and early 1980s, rockabilly enjoyed a major revival. An interest in the genre endures even in the 21st century, often within a subculture. Rockabilly has left a legacy, spawning a variety of sub-styles and influencing other genres such as punk rock.</p>",
	"links": ["punk", "country", "funk", "rock", "soul"]
}, {
	"name": "romance",
	"color": "#bfbf00",
	"x": 635,
	"y": 635,
	"z": -1275,
	"info": "<p>The term <b>romance</b> (Spanish: <i lang=\"es\">romance/romanza</i>, Italian: <i lang=\"it\">romanza</i>, German: <i lang=\"de\">Romanze</i>, French: <i lang=\"fr\">romance</i>, Russian: <span lang=\"ru\">романс</span>, Portuguese: <i lang=\"pt\">romance</i>, Romanian: <i lang=\"ro\">romanţă</i>) has a centuries-long history. Applied to narrative ballads in Spain, it came to be used by the 18th century for simple lyrical pieces not only for voice, but also for instruments alone. The <i>Oxford Dictionary of Music</i> states that \"generally it implies a specially personal or tender quality\".\n</p>\n\n\n",
	"links": ["pop", "singer-songwriter", "rock", "edm", "country", "reggaeton", "folk", "house", "latin", "emo"]
}, {
	"name": "sad",
	"color": "#666600",
	"x": -255,
	"y": -255,
	"z": -1275,
	"info": "Music that you listen to when you feel sad or music that will make you sad.",
	"links": ["emo", "pop", "punk", "singer-songwriter", "rock", "folk", "rockabilly", "metalcore", "country", "soul"]
}, {
	"name": "salsa",
	"color": "#ff5942",
	"x": 1275,
	"y": -385,
	"z": -615,
	"info": "<p><b>Salsa music</b> is a popular dance music genre that initially arose in New York City during the 1960s. Salsa is the product of various musical genres including the Cuban son montuno, guaracha, cha cha chá, mambo, and to a certain extent bolero, and the Puerto Rican bomba and plena. Latin jazz, which was also developed in New York City, has had a significant influence on salsa arrangers, piano guajeos, and instrumental soloists.</p><p>Salsa is primarily Cuban son, itself a fusion of Spanish canción and guitar and Afro-Cuban percussion, merged with North American music styles such as jazz. Salsa also occasionally incorporates elements of rock, R&amp;B, and funk. All of these non-Cuban elements are grafted onto the basic Cuban son montuno template when performed within the context of salsa.</p><p>The first salsa bands were predominantly Cubans and Puerto Ricans who moved to New York since the 1920s. The music eventually spread throughout Colombia and the rest of the Americas. Ultimately, it became a global phenomenon. Some of the founding salsa artists were Johnny Pacheco (the creator of the Fania All-Stars), Celia Cruz, Ray Barretto, Rubén Blades, Willie Colón, Larry Harlow, Roberto Roena, Bobby Valentín, Eddie Palmieri, and Héctor Lavoe.</p>",
	"links": ["latin", "pop"]
}, {
	"name": "samba",
	"color": "#b2804c",
	"x": 505,
	"y": 5,
	"z": -515,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n<p><b>Samba</b> (<small>Portuguese pronunciation: </small><span title=\"Representation in the International Phonetic Alphabet (IPA)\">[ˈsɐ̃bɐ]</span><small class=\"nowrap\"> (<span><span><span></span>listen</span></span>)</small>) is a Brazilian musical genre and dance style, with its roots in Africa via the West African slave trade and African religious traditions, particularly of Angola and the Congo, through the samba de roda genre of the northeastern Brazilian state of Bahia, from which it derived. Although there were various forms of samba in Brazil with popular rhythms  originated from drumming, samba as a music genre has its origins in Rio de Janeiro, the former capital of Brazil.\n</p><p>Samba is recognized around the world as a symbol of Brazil and the Brazilian Carnival. Considered one of the most popular Brazilian cultural expressions, samba has become an icon of Brazilian national identity.\nThe Bahian Samba de Roda (dance circle), was added to the UNESCO Intangible Cultural Heritage List in 2005. It is the main root of  the <i>samba carioca</i>, the samba that is played and danced in Rio de Janeiro.\n</p>\n\n<p>The modern samba that emerged at the beginning of the 20th century is predominantly in a 2/4 time signature varied with the conscious use of a sung chorus to a batucada rhythm, with various stanzas of declaratory verses. Traditionally, the samba is played by strings (cavaquinho and various types of guitar) and various percussion instruments such as tamborim. Influenced by American orchestras in vogue since the Second World War and the cultural impact of US music post-war, samba began to use trombones, trumpets, choros, flutes, and clarinets.</p><p>In addition to distinct rhythms and meters, samba brings a whole historical culture of food, varied dances (miudinho, coco, samba de roda, and pernada), parties, clothes such as linen shirts, and the Naif painting of established names such as Nelson Sargento, Guilherme de Brito, and Heitor dos Prazeres. Anonymous community artists, including painters, sculptors, designers, and stylists, make the clothes, costumes, carnival floats, and cars, opening the doors of schools of samba. There is also a great tradition of ballroom samba in Brazil, with many styles. Samba de Gafieira is the style more famous in Rio de Janeiro, where common people used to go to the gafieira parties since the 1930s, and where the moves and identity of this dance have emerged, getting more and more different from its African, European and Cuban origins and influences.\n</p><p>The Samba National Day is celebrated on December 2. The date was established at the initiative of Luis Monteiro da Costa, an Alderman of Salvador, in honor of Ary Barroso. He composed \"<i>Na Baixa do Sapateiro</i>\" even though he had never been in Bahia. Thus 2 December marked the first visit of Ary Barroso to Salvador. Initially, this day was celebrated only in Salvador, but eventually it turned into a national holiday.\n</p><p>Samba is a local style in Southeastern Brazil and Northeast Brazil, especially in Rio de Janeiro, São Paulo, Salvador and Recife. Its importance as Brazil's national music transcends region, however; samba schools, samba musicians and carnival organizations centered on the performance of samba exist in every region of the country, even though other musical styles prevail in various regions (for instance, in Southern Brazil, Center-West Brazil, and all of the Brazilian countryside, Sertanejo, or Brazilian country music, is the most popular style).</p>",
	"links": ["forro", "mpb", "pagode"]
}, {
	"name": "sertanejo",
	"color": "#ab8c4a",
	"x": 435,
	"y": 125,
	"z": -535,
	"info": "<p><b>Música sertaneja</b> (<small>Portuguese pronunciation: </small><span title=\"Representation in the International Phonetic Alphabet (IPA)\">[ˈmuzikɐ seʁtaˈneʒɐ]</span>) or <b>Sertanejo</b> (<small>pronounced </small><span title=\"Representation in the International Phonetic Alphabet (IPA)\">[seʁtaˈneʒu]</span>) is a music style that had its origins in the countryside of Brazil in the 1920s. It is the most popular music style in Brazil, particularly throughout the southern/southeastern and center-western countryside Brazil. Subgenres include <i>sertanejo de raiz</i>, <i>sertanejo romântico</i>, and <i>sertanejo universitário</i>.\n</p><p>Sertanejo songs have been, since from the 1990s on, the most played music genre on Brazilian radio, constantly topping the Brazilian music charts. Additionally, from 2000 to 2003 and since 2009, música sertaneja albums have been granted a specific category at the Latin Grammy Awards.\n</p><p>Most of sertanejo music artists consist of duos, at times made of brother siblings, typically with one of them being the backing vocalist to the other one. Men have traditionally dominated the scene, although recently some women (notably, Paula Fernandes and Maria Cecília) have also achieved mainstream success.\n</p><p>The subgenre, called \"sertanejo universitário\" (college sertanejo), has developed from the mid-2000s on, consisting of a more stripped-down, acoustic-oriented use of the guitars, and has come to grow very popular among the Brazilian youth.\n</p>",
	"links": ["pagode", "forro", "mpb", "samba"]
}, {
	"name": "show-tunes",
	"color": "#ffff33",
	"x": 1275,
	"y": 1275,
	"z": -765,
	"info": "<p>A <b>show tune</b> is a song originally written as part of the score of a musical stage show or musical, especially if the piece in question has become a standard, more or less detached in most people's minds from the original context. Particular musicals that have yielded popular “show tunes” include:\n</p>\n<ul><li>Richard Rodgers and Oscar Hammerstein's <i>Oklahoma!, Carousel, South Pacific, The King and I, Flower Drum Song, The Sound of Music</i></li>\n<li>Jerome Kern and Hammerstein's <i>Show Boat</i></li>\n<li>Rudolf Friml, Herbert Stothart, Otto Harbach and Hammerstein's <i>Rose-Marie</i></li>\n<li>Richard Rodgers and Lorenz Hart's <i>Pal Joey</i></li>\n<li>Irving Berlin's <i>Annie Get Your Gun, As Thousands Cheer, Call Me Madam</i></li>\n<li>Cole Porter's <i>Anything Goes, Kiss Me, Kate, Can-Can</i></li>\n<li>George and Ira Gershwin's <i>Girl Crazy, Oh, Kay!</i></li>\n<li>Jerry Bock and Sheldon Harnick's <i>Fiddler on the Roof</i></li>\n<li>Alan Jay Lerner and Frederick Loewe's <i>Brigadoon, Paint Your Wagon, My Fair Lady, Gigi, Camelot</i></li>\n<li>Meredith Willson's <i>The Music Man</i></li>\n<li>Frank Loesser's <i>Guys and Dolls</i>, <i>How to Succeed in Business Without Really Trying</i></li>\n<li>Leonard Bernstein and Stephen Sondheim's <i>West Side Story</i></li>\n<li>Leslie Bricusse and Anthony Newley's <i>Stop the World – I Want to Get Off</i>, <i>The Roar of the Greasepaint – The Smell of the Crowd</i></li>\n<li>Lin-Manuel Miranda's <i>Hamilton</i></li>\n<li>Bricusse, Frank Wildhorn and Steve Cuden's <i>Jekyll &amp; Hyde</i></li>\n<li>Jerry Herman's <i>Milk and Honey, Hello, Dolly!, Mame, Dear World, Mack and Mabel, La Cage aux Folles</i></li>\n<li>Stephen Sondheim's <i>A Funny Thing Happened on the Way to the Forum, Company, Follies, Sunday in the Park with George, Sweeney Todd, A Little Night Music</i> and <i>Into the Woods</i></li>\n<li>John Kander and Fred Ebb's <i>Cabaret</i>, and <i>Chicago</i></li>\n<li>Andrew Lloyd Webber's <i>Evita, Jesus Christ Superstar, Cats, The Phantom of the Opera, Starlight Express, Sunset Boulevard, Joseph and the Amazing Technicolor Dreamcoat</i></li>\n<li>Stephen Schwartz's <i>Pippin</i>, <i>Godspell</i>, and <i>Wicked</i></li>\n<li>Jonathan Larson's <i>Rent</i></li>\n<li>Claude-Michel Schönberg's <i>Les Misérables, Miss Saigon</i></li>\n<li>Jim Jacobs and Warren Casey's <i>Grease</i></li></ul><p>Though show tunes vary in style, they do tend to share common characteristics—they usually fit the context of a story being told in the original musical, they are useful in enhancing and heightening choice moments. A particularly common form of show tune is the \"I Want\" song, which composer Stephen Schwartz noted as being particularly likely to have a lifespan outside the show that spawned it.</p><p>Show tunes were a major venue for popular music before the rock and roll and television era; most of the hits of such songwriters as Jerome Kern, Cole Porter, and George Gershwin came from their shows. (Even into the television and rock era, a few stage musicals managed to turn their show tunes into major pop music hits, sometimes aided by film adaptations and exposure through variety shows.) Although show tunes no longer have such a major role in popular music as they did in their heyday, they remain somewhat popular, especially among niche audiences. Show tunes make up a disproportionate part of the songs in most variations of the Great American Songbook.\n</p><p>The reverse phenomenon, when already popular songs are used to form the basis of a stage musical, is known as a jukebox musical.\n</p>",
	"links": ["pop", "disney", "singer-songwriter", "disco", "rock"]
}, {
	"name": "singer-songwriter",
	"color": "#a6a600",
	"x": 385,
	"y": 385,
	"z": -1275,
	"info": "<p>\n<b>Singer-songwriters</b> are musicians who write, compose, and perform their own musical material, including lyrics and melodies.\n</p><p>The genre began with the folk-acoustic tradition. Singer-songwriters often provide the sole accompaniment to an entire composition or song, typically using a guitar or piano.\n</p>\n\n\n",
	"links": ["folk", "rock", "pop", "edm"]
}, {
	"name": "ska",
	"color": "#a60042",
	"x": 385,
	"y": -1275,
	"z": -615,
	"info": "<p><b>Ska</b> (<span></span>; <small>Jamaican: </small><span title=\"Representation in the International Phonetic Alphabet (IPA)\">[skjæ]</span>) is a music genre that originated in Jamaica in the late 1950s and was the precursor to rocksteady and reggae. It combined elements of Caribbean mento and calypso with American jazz and rhythm and blues. Ska is characterized by a walking bass line accented with rhythms on the off beat. It developed in Jamaica in the 1960s when Prince Buster, Clement \"Coxsone\" Dodd, and Duke Reid formed sound systems to play American rhythm and blues and then began recording their own songs. In the early 1960s, ska was the dominant music genre of Jamaica and was popular with British mods. Later it became popular with many skinheads.</p><p>Music historians typically divide the history of ska into three periods: the original Jamaican scene of the 1960s; the 2 Tone ska revival of the late 1970s in Britain, which fused Jamaican ska rhythms and melodies with the faster tempos and harder edge of punk rock; and third wave ska, which involved bands from the UK, other European countries (notably Germany), Australia, Japan, South America and the United States, beginning in the 1980s and peaking in the 1990s.</p>",
	"links": ["punk", "reggae", "dub"]
}, {
	"name": "sleep",
	"color": "#a4a400",
	"x": 365,
	"y": 365,
	"z": -1275,
	"info": "Music that will help you fall asleep",
	"links": ["pop", "emo", "singer-songwriter", "latin", "ambient", "electronic", "edm", "rock", "country", "folk"]
}, {
	"name": "songwriter",
	"color": "#616100",
	"x": -305,
	"y": -305,
	"z": -1275,
	"info": "<p>A <b>songwriter</b> is a professional that writes lyrics or musical compositions for songs. A songwriter can also be called a composer, although the latter term tends to be used mainly for individuals from the classical music genre and Film Scoring. The pressure from the music industry to produce popular hits means that songwriting is often an activity for which the tasks are distributed between a number of people. For example, a songwriter who excels at writing lyrics might be paired with a songwriter with the task of creating original melodies. Pop songs may be written by group members from the band or by staff writers – songwriters directly employed by music publishers. Some songwriters serve as their own music publishers, while others have outside publishers.</p><p>The old-style apprenticeship approach to learning how to write songs is being supplemented by university degrees and college diplomas and \"rock schools\". Knowledge of modern music technology (sequencers, synthesizers, computer sound editing), songwriting elements and business skills are now often necessary requirements for a songwriter. Several music colleges offer songwriting diplomas and degrees with music business modules. Since songwriting and publishing royalties can be substantial sources of income, particularly if a song becomes a hit record, legally, in the US, songs written after 1934 may be copied only by the authors. The legal power to grant these permissions may be bought, sold or transferred. This is governed by international copyright law.</p><p>Songwriters can be employed to write either the lyrics or the music directly for or alongside a performing artist, or they present songs to A&amp;R, publishers, agents and managers for consideration. Song pitching can be done on a songwriter's behalf by their publisher or independently using tip sheets like <i>RowFax</i>, the <i>MusicRow</i> publication and <i>SongQuarters</i>. Skills associated with song-writing include entrepreneurism and creativity.</p>",
	"links": ["folk", "rock", "singer-songwriter", "pop"]
}, {
	"name": "soul",
	"color": "#ff3352",
	"x": 1275,
	"y": -765,
	"z": -455,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n<p><b>Soul music</b> (often referred to simply as <b>soul</b>) is a popular music genre that originated in the African American community in the United States in the 1950s and early 1960s. It combines elements of African-American gospel music, rhythm and blues and jazz. Soul music became popular for dancing and listening in the United States, where record labels such as Motown, Atlantic and Stax were influential during the Civil Rights Movement. Soul also became popular around the world, directly influencing rock music and the music of Africa.</p><p>According to the Rock and Roll Hall of Fame, soul is \"music that arose out of the black experience in America through the transmutation of gospel and rhythm &amp; blues into a form of funky, secular testifying\". Catchy rhythms, stressed by handclaps and extemporaneous body moves, are an important feature of soul music. Other characteristics are a call and response between the lead vocalist and the chorus and an especially tense vocal sound. The style also occasionally uses improvisational additions, twirls and auxiliary sounds. Soul music reflected the African-American identity and it stressed the importance of an African-American culture. The new-found African-American consciousness led to new styles of music, which boasted pride in being black.</p><p>Soul music dominated the U.S. R&amp;B chart in the 1960s, and many recordings crossed over into the pop charts in the U.S., Britain and elsewhere. By 1968, the soul music genre had begun to splinter. Some soul artists developed funk music, while other singers and groups developed slicker, more sophisticated, and in some cases more politically conscious varieties. By the early 1970s, soul music had been influenced by psychedelic rock and other genres, leading to psychedelic soul. The United States saw the development of neo soul around 1994. There are also several other subgenres and offshoots of soul music.\n</p><p>The key subgenres of soul include the Detroit (Motown) style, a rhythmic music influenced by gospel; <i>deep soul</i> and <i>southern soul</i>, driving, energetic soul styles combining R&amp;B with southern gospel music sounds; Memphis soul, a shimmering, sultry style; New Orleans soul, which came out of the rhythm and blues style; Chicago soul, a lighter gospel-influenced sound; Philadelphia soul, a lush orchestral sound with doo-wop-inspired vocals; psychedelic soul, a blend of psychedelic rock and soul music; as well as categories such as blue-eyed soul, which is soul music performed by white artists; British soul; and Northern soul, rare soul music played by DJs at nightclubs in Northern England.\n</p>",
	"links": ["edm", "pop", "funk", "disco", "rockabilly", "blues"]
}, {
	"name": "soundtracks",
	"color": "#ffb200",
	"x": 1275,
	"y": 505,
	"z": -1275,
	"info": "<p>A <b>soundtrack</b>, also written <b>sound track</b>, can be recorded music accompanying and synchronized to the images of a motion picture, book, television program, or video game; a commercially released soundtrack album of music as featured in the soundtrack of a film, video, or television presentation; or the physical area of a film that contains the synchronized recorded sound.\n</p>\n\n\n",
	"links": ["classical", "disney", "pop", "folk", "soul", "country", "electro", "electronic", "rock", "disco", "funk", "opera"]
}, {
	"name": "spanish",
	"color": "#ffa345",
	"x": 1275,
	"y": 355,
	"z": -585,
	"info":"<p>The <b>music of Spain</b> has a long history. It has played an important role in the development of Western music, and has greatly influenced Latin American music. Spanish music is often associated with traditional styles such as flamenco and classical guitar. While these forms of music are common, there are many different traditional musical and dance styles across the regions. For example, music from the north-west regions is heavily reliant on bagpipes, the jota is widespread in the centre and north of the country, and flamenco originated in the south. Spanish music played a notable part in the early developments of western classical music, from the 15th through the early 17th century. The breadth of musical innovation can be seen in composers like Tomás Luis de Victoria, styles like the zarzuela of Spanish opera, the ballet of Manuel de Falla, and the classical guitar music of Francisco Tárrega. Nowadays commercial pop music dominates.\n</p>",
	"links": ["latin", "pop", "reggaeton", "salsa", "pagode", "sertanejo", "dancehall"]
}, {
	"name": "study",
	"color": "#aeae50",
	"x": 465,
	"y": 465,
	"z": -475,
	"info": "Music that is nice to listen to while studying",
	"links": ["pop", "edm", "rock", "singer-songwriter", "house", "country", "electro", "electronic", "disco", "classical"]
}, {
	"name": "summer",
	"color": "#b7b747",
	"x": 555,
	"y": 555,
	"z": -565,
	"info": "Music that is nice to listen to during the summer",
	"links": ["pop", "edm", "house", "reggae", "trance", "latin", "electro", "electronic", "disco", "rock", "emo", "folk", "country", "punk"]
}, {
	"name": "swedish",
	"color": "#c0c03e",
	"x": 645,
	"y": 645,
	"z": -655,
	"info": "<p>The <b>Music of Sweden</b> shares the tradition of Nordic folk dance music with its neighboring countries in northern Europe, including polka, schottische, waltz, polska and mazurka. The accordion, clarinet, fiddle and nyckelharpa are among the most common Swedish folk instruments. The instrumental genre is the biggest one in Swedish traditional music. In the 1960s, Swedish youth sparked a roots revival in Swedish folk culture. Many joined <i>Spelmanslag</i> (folk musicians' clubs) and performed on mainstream radio and TV. They focused on instrumental polska music, with vocals and influences from other traditional genres becoming more prominent since the 1990s. By 1970, the \"dansband\" culture also began.\n</p><p>Swedish music has also included more modern and pop influences. On a per capita basis, Sweden is one of the world's most successful exporters of popular music. Its most famous export is ABBA, which was a worldwide musical phenomenon. Another Swedish artist, DeDe, was so successful in Japan in the late 1990s that she inspired a collectible doll. Sweden has also historically dominated the Scandinavian music scene, with Danes and Norwegians listening to music in Swedish rather than the other way around. In the late 1980s and early 1990s, Scandinavian death metal bands became very popular with the international heavy metal community.\n</p><p>Sweden's most classic troubadour was Carl Michael Bellman. Others include Evert Taube, Cornelis Vreeswijk, Fred Åkerström, and Povel Ramel.\n</p>",
	"links": ["pop", "edm"]
}, {
	"name": "synth-pop",
	"color": "#676797",
	"x": -245,
	"y": -245,
	"z": 235,
	"info": "<p class=\"mw-empty-elt\">\n\n</p>\n<p><b>Synth-pop</b> (short for <b>synthesizer pop</b>; also called <b>techno-pop</b>) is a subgenre of new wave music that first became prominent in the late 1970s and features the synthesizer as the dominant musical instrument. It was prefigured in the 1960s and early 1970s by the use of synthesizers in progressive rock, electronic, art rock, disco, and particularly the \"Krautrock\" of bands like Kraftwerk. It arose as a distinct genre in Japan and the United Kingdom in the post-punk era as part of the new wave movement of the late 1970s to the mid-1980s.\n</p><p>Early synth-pop pioneers included Japanese group Yellow Magic Orchestra, and British bands Ultravox, the Human League and Berlin Blondes. The Human League used monophonic synthesizers to produce music with a simple and austere sound. After the breakthrough of Gary Numan in the UK Singles Chart in 1979, large numbers of artists began to enjoy success with a synthesizer-based sound in the early 1980s, including late-1970s debutants like Japan and Orchestral Manoeuvres in the Dark, and newcomers such as Depeche Mode and Eurythmics. In Japan, Yellow Magic Orchestra's success opened the way for synth-pop bands such as P-Model, Plastics, and Hikashu. The development of inexpensive polyphonic synthesizers, the definition of MIDI and the use of dance beats, led to a more commercial and accessible sound for synth-pop. This, its adoption by the style-conscious acts from the New Romantic movement, together with the rise of MTV, led to success for large numbers of British synth-pop acts (including Duran Duran and Spandau Ballet) in the United States.\n</p><p>\"Synth-pop\" is sometimes used interchangeably with \"electropop\", but \"electropop\" may also denote a variant of synth-pop that places more emphasis on a harder, more electronic sound. In the mid to late 1980s, duos such as Erasure and Pet Shop Boys adopted a style that was highly successful on the US dance charts, but by the end of the decade, the 'new wave' synth-pop of bands such as A-Ha and Alphaville was giving way to house music and techno. Interest in new wave synth-pop began to revive in the indietronica and electroclash movements in the late 1990s, and in the first decade of the 21st century synth-pop enjoyed a widespread revival, with commercial success for acts including Lady Gaga, Rihanna, La Roux, Owl City, M83 and Chvrches.\n</p><p>The genre has received criticism for alleged lack of emotion and musicianship; prominent artists have spoken out against detractors who believed that synthesizers themselves composed and played the songs. Synth-pop music has established a place for the synthesizer as a major element of pop and rock music, directly influencing subsequent genres (including house music and Detroit techno) and has indirectly influenced many other genres, as well as individual recordings.\n</p>",
	"links": ["edm", "house", "pop", "rock", "electronic", "folk", "disco", "dancehall"]
}, {
	"name": "tango",
	"color": "#591247",
	"x": -385,
	"y": -1095,
	"z": -565,
	"info": "<p><b>Tango</b> is a style of music in <span><span><span><sup style=\"font-size:inherit;line-height:inherit;vertical-align:baseline\"><b>2</b></sup><br><sub style=\"font-size:inherit;line-height:inherit;vertical-align:baseline\"><b>4</b></sub></span></span></span> or <span><span><span><sup style=\"font-size:inherit;line-height:inherit;vertical-align:baseline\"><b>4</b></sup><br><sub style=\"font-size:inherit;line-height:inherit;vertical-align:baseline\"><b>4</b></sub></span></span></span> time that originated among European immigrant populations of Argentina and Uruguay (collectively, the \"Rioplatenses\"). It is traditionally played on a solo guitar, guitar duo, or an ensemble, known as the <i>orquesta típica</i>, which includes at least two violins, flute, piano, double bass, and at least two bandoneóns. Sometimes guitars and a clarinet join the ensemble. Tango may be purely instrumental or may include a vocalist. Tango music and dance have become popular throughout the world.\n</p>",
	"links": ["folk", "rock", "singer-songwriter", "latin", "jazz", "soul", "pop", "classical"]
}, {
	"name": "techno",
	"color": "#0d03fc",
	"x": -1145,
	"y": -1245,
	"z": 1245,
	"info": "<p><b>Techno</b>  is a form of electronic dance music that emerged in Detroit, Michigan, in the United States during the mid-to-late 1980s. The first recorded use of the word <i>techno</i> in reference to a specific genre of music was in 1988. Many styles of techno now exist, but Detroit techno is seen as the foundation upon which a number of sub-genres have been built.</p><p>In Detroit, techno resulted from the melding of black styles including Chicago house, funk, electro, and electric jazz with electronic music by artists such as Kraftwerk, Giorgio Moroder, and Yellow Magic Orchestra.  Added to this is the influence of futuristic and fictional themes relevant to life in American late capitalist society, with Alvin Toffler's book <i>The Third Wave</i> being a notable point of reference. Pioneering producer and DJ Juan Atkins cites Toffler's phrase \"techno rebels\" as inspiring him to use the word <i>techno</i> to describe the musical style he helped to create. This unique blend of influences aligns techno with the aesthetic referred to as afrofuturism.To producers such as Derrick May, the transference of spirit from the body to the machine is often a central preoccupation; essentially an expression of technological spirituality. In this manner: \"techno dance music defeats what Adorno saw as the alienating effect of mechanisation on the modern consciousness\".</p><p>Stylistically, techno is generally repetitive instrumental music, often produced for use in a continuous DJ set. The central rhythmic component is most often in common time (4/4), where time is marked with a bass drum on each quarter note pulse, a backbeat played by snare or clap on the second and fourth pulses of the bar, and an open hi-hat sounding every second eighth note. The tempo tends to vary between approximately 120 to 150 beats per minute (bpm), depending on the style of techno. The creative use of music production technology, such as drum machines, synthesizers, and digital audio workstations, is viewed as an important aspect of the music's aesthetic. Many producers use retro electronic musical devices to create what they consider to be an authentic techno sound. Drum machines from the 1980s such as Roland's TR-808 and TR-909 are highly prized, and software emulations of such retro technology are popular among techno producers.\n</p><p>Music journalists and fans of techno are generally selective in their use of the term; so a clear distinction can be made between sometimes related but often qualitatively different styles, such as tech house and trance.</p>",
	"links": ["edm", "electro", "house", "pop", "trance", "electronic", "rock", "hardstyle", "breakbeat", "dubstep"]
}, {
	"name": "trance",
	"color": "#1a05fa",
	"x": -1015,
	"y": -1225,
	"z": 1225,
	"info": "<p><b>Trance</b> is an abnormal state of wakefulness in which a person is not self-aware and is either altogether unresponsive to external stimuli but is nevertheless capable of pursuing and realizing an aim, or is selectively responsive in following the directions of the person who has induced the trance. Trance states may occur involuntarily and unbidden.\n</p><p>The term <i>trance</i> may be associated with hypnosis, meditation, magic, flow, and prayer. It may also be related to the earlier generic term, altered states of consciousness, which is no longer used in \"consciousness studies\" discourse.\n</p>",
	"links": ["edm", "house", "pop", "folk", "electronic"]
}, {
	"name": "trip-hop",
	"color": "#2626d9",
	"x": -895,
	"y": -895,
	"z": 895,
	"info": "<p class=\"mw-empty-elt\">\n</p>\n<p><b>Trip hop</b> (sometimes used synonymously with \"downtempo\") is a musical genre that originated in the early 1990s in the United Kingdom, especially Bristol. It has been described as \"a fusion of hip hop and electronica until neither genre is recognizable\", and may incorporate a variety of styles, including funk, dub, soul, psychedelia, R&amp;B, and house, as well as other forms of electronic music. Trip hop can be highly experimental.</p><p>Deriving from later idioms of acid house, the term was first used by the British music media to describe the more experimental variant of breakbeat emerging from the Bristol Sound scene in the early 1990s, which contained influences of soul, funk, and jazz. It was pioneered by acts like Massive Attack, Tricky, and Portishead. Trip hop achieved commercial success in the 1990s, and has been described as \"Europe's alternative choice in the second half of the '90s.\"</p>",
	"links": ["electronic", "edm", "pop", "j-dance", "tango"]
}, {
	"name": "turkish",
	"color": "#73738c",
	"x": -125,
	"y": -125,
	"z": 125,
	"info": "<p>The <b>music of Turkey</b> includes mainly Turkic elements as well as partial influences ranging from Central Asian folk music, Arabic music, Greek music, Ottoman music, Persian music and Balkan music, as well as references to more modern European and American popular music. Turkey is a country on the northeastern shore of the Mediterranean Sea, and is a crossroad of cultures from across Europe, North Africa, the Middle East, the Caucasus and South and Central Asia\n</p><p>The roots of traditional music in Turkey span across centuries to a time when the Seljuk Turks migrated to Anatolia and Persia in the 11th century and contains elements of both Turkic and pre-Turkic influences. Much of its modern popular music can trace its roots to the emergence in the early 1930s drive for Westernization.</p><p>With the assimilation of immigrants from various regions the diversity of musical genres and musical instrumentation also expanded. Turkey has also seen documented folk music and recorded popular music produced in the ethnic styles of Greek, Armenian, Albanian, Polish, Azeri and Jewish communities, among others. Many Turkish cities and towns have vibrant local music scenes which, in turn, support a number of regional musical styles.\nDespite this however, western-style pop music lost popularity to arabesque in the late 1970s and 1980s, with even its greatest proponents, Ajda Pekkan and Sezen Aksu, falling in status. It became popular again by the beginning of the 1990s, as a result of an opening economy and society. With the support of Aksu, the resurging popularity of pop music gave rise to several international Turkish pop stars such as Tarkan and Sertab Erener. The late 1990s also saw an emergence of underground music producing alternative Turkish rock, electronica, hip-hop, rap and dance music in opposition to the mainstream corporate pop and arabesque genres, which many believe have become too commercial.</p>",
	"links": ["latin", "pop", "edm", "house", "rock", "reggaeton"]
}, {
	"name": "work-out",
	"color": "#4040bf",
	"x": -635,
	"y": -635,
	"z": 635,
	"info": "<p>The interplay of <b>exercise and music</b> have been long-discussed, crossing the disciplines of biomechanics, neurology, physiology, and sport psychology. People \"automatically feel the beat\" of the music they listen to and instinctively adjust their walking pace and heart rate to the tempo of the music\n. Listening to music while exercising has been found in multiple studies to create an increased sense of motivation, distracting the mind while increasing heart rate. Faster tempo music has been found by researchers to motivate exercisers to work harder when performing at a moderate pace, but peak performance has been found to be unaffected by listening to music.</p><p>In a study published in 2009, researchers at the Research Institute for Sport and Exercise Sciences at Liverpool John Moores University had 12 subjects ride a stationary bicycle at a pace that they could sustain for 30 minutes while listening to a song of the subject's choice. In successive trials, they rode the bikes again, with the tempo of the music variously increased or decreased by 10%, without the subject's knowledge. The researchers results showed that the riders heart rate and mileage decreased when the tempo was slowed, while they rode a greater distance, increased their heart rate and enjoyed the music more at the faster tempo. Though the participants thought their workout was harder at the more upbeat tempo, the researchers found that when the faster-paced music was heard while exercising \"the participants chose to accept, and even prefer, a greater degree of effort\".</p><p>Scientists at the University of Wisconsin–La Crosse found in a 2003 study that participants who chose to listen to faster-paced music generated a higher heart rate, pedaled harder and generated more power, increasing their level of work by as much as 15% by diverting their focus to the music. The study tested 20 volunteers who listened to an MP3 player loaded with a mix of 13 songs that they selected and then rode an exercise bike for an hour at a pace and gear of their choice. The study found that heart rates rose from 133 to 146 beats per minute and power output increased accordingly, when listening to the tempo-less sound of crashing waves versus music with a medium to fast tempo.</p><p>A 2004 study by a research team from Australia, Israel and the United States found that runners performing at a pace where they were at 90% of their peak oxygen uptake enjoyed listening to music. Crazy enough, the music had no effect on their heart rate or running pace, regardless of the music's tempo.</p><p>Generally, studies suggest that athletes use music in purposeful ways to facilitate training and performance. In one study, seventy elite Swedish athletes completed a questionnaire relating the empirical motives for listening to music. The results showed that most of they often listened to music during pre-event, pre-training sessions, and warm-ups. The athletes gave as reasons for listening to music that they felt that it increased activation, positive affect, motivation, performance levels, and flow. There are also types workout music using brainwave entrainment that claims to boost performance.</p><p>To further this idea, a study from the <i>New York Times</i> shows how music helps boost workouts. This experiment was done by testing a control group of people working out in a normal workout setting and the same group of people working out with machines that incorporated beats and rhythms into each rep. To do this, they installed the kits into three different workout machines, one a stair-stepper, the other two weight machines with bars that could be raised or pulled down to stimulate various muscles. Thomas Hans Fritz, a researcher at the Max Planck Institute who led the study said, “Participants could express themselves on the machines by, for instance, modulating rhythms and creating melodies.” Throughout each workout, the researchers monitored the force their volunteers generated while using the machines, as well as whether the weight lifters’ movements tended to stutter or flow and how much oxygen the volunteers consumed, a reliable measure of physical effort. Afterward, the scientists asked the volunteers to rate the tolerability or unpleasantness of the session, on a scale from 1 to 20.</p>",
	"links": ["punk", "rock", "pop", "edm", "house", "trance", "electro", "latin", "electronic", "disco", "reggaeton"]
}, {
	"name": "world-music",
	"color": "#4040bf",
	"x": -635,
	"y": -635,
	"z": 635,
	"info": "<p><b>World music</b> (also called <b>global music</b> or <b>international music</b>) is a musical category encompassing many different styles of music from around the globe, which includes many genres including some forms of Western music represented by folk music, Jazz, as well as selected forms of ethnic music, indigenous music, neotraditional music, and music where more than one cultural tradition, such as ethnic music and Western popular music, intermingle.\n</p><p>World music's inclusive nature and elasticity as a musical category may pose for some obstacles to a universal definition, but its ethic of interest in the culturally exotic is encapsulated in <i>Roots</i> magazine's description of the genre as \"local music from out there\".</p><p>The term was popularized in the 1980s as a marketing category for non-Western traditional music. Globalization has facilitated the expansion of world music's audiences and scope. It has grown to include hybrid subgenres such as world fusion, global fusion, ethnic fusion, and worldbeat.</p>",
	"links": ["afrobeat", "tango", "metal", "rock", "mpb", "samba", "dancehall", "dub", "reggae", "pagode", "sertanejo", "folk", "singer-songwriter", "blues", "forro"]
}]